{
    "Replies": [
        {
            "ID": "c2fm2lf7f64tkgl40q3g",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 6, 2012 at 5:52 pm",
            "Content": "Pirates is an interesting case, where because the show was _better_ than I thought it would be, it is notably _less_ interesting than it could have been. Action shows need to have action, and a lot of it. Consistency and complex characters be damned – these shows are driven purely by adrenaline, and so they need to supply it at a constant rate to keep the audience watching. With nothing else going for it, the one thing shows like this can’t afford to do is settle into a routine, and become _boring_. I appreciate the level of realism Pirates is trying to maintain with all of the warfare that _doesn’t_ involve shooting, because that’s the kind of stuff that actually wins wars, but this somewhat compromises the point of the show. D-Day was one small part of WWII. You know why there are such a disproportionately large number of war documentaries on that alone? Because there were lots of guns, explosions, heroism, and it’s overall really cool to watch. Leave the “electronic warfare” and political misdirection off-camera, and show us some damn fighting already.\n\nNo comment on Natsume Yuujinchou. Aside from the first 3 episodes of the first season, I’ve never watched it. It’s probably good, but I wouldn’t know.\n\nAnother is a show I’m following this season. It’s certainly reminiscent of things like Higurashi, but Matt points out the biggest flaw – subtlety, or lack thereof. Every single part of Another (save for a couple sparse moments) is made only to emphasize the creepy atmosphere. I assume Yomiyama is actually a pretty nice place to live (aside from Class 3, of course), and that most of its population is pretty happy, but given the perspective, you’d think Kouichi lives in Silent Hill. The creepiness becomes status quo, and as such, it ends up desensitizing viewers. Now, it’s jarring and uncomfortable when something _normal_ happens. I think what made Higurashi so memorable is that you could trust nothing you saw to either be true or false. The truth is diluted in lies, and lies in truth. The picture was clear enough that it made you want to look closer, but blurry enough that you never could really make out what was behind it – like a frosted windowpane. But everything in Another is creepy, and everything lies. You can only throw viewers so many red herrings before they give up, and once that happens, the mystery and horror loses half its impact. Still, it’s interesting enough that I’ve still got theories, and I’m interested to see its conclusion. I only hope it doesn’t disappoint."
        }
    ]
}