{
    "Replies": [
        {
            "ID": "c2fm44n7f64tkgl40vkg",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 20, 2010 at 3:14 pm",
            "Content": "Extremely talented seiyuu, definitely one of my favorites. Some of my favorite lines in Higurashi were delivered by that voice."
        },
        {
            "ID": "c2fm44n7f64tkgl40vl0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 21, 2010 at 1:31 pm",
            "Content": "I believe she was in the Clannad anime, as Sunohara’s dorm mother, Sagara Misae. She was also the main heroine in Full Metal Panic!, Chidori Kaname, and the main character in Planetes, Tanabe Ai. My favorite performance of her, though, had to be the Sonozaki twins in Higurashi-it was very amusing to hear some of the conversations she held with herself (especially the dungeon scenes).\n\nI didn’t know she played Hoshimaru as well, though. After a quick look-up, I found she also played Kuri Mamiko (a character that didn’t appear in showing, but an important one later one). I was all o\\_O",
            "Replies": [
                {
                    "ID": "c2fm44n7f64tkgl40vlg",
                    "ParentID": "c2fm44n7f64tkgl40vl0",
                    "Author": "Chaeha",
                    "ReplyTo": "Chris",
                    "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "November 21, 2010 at 2:25 pm",
                    "Content": "I thought I’d mention Chidori and Mamiko, but I got tired trying to look for pictures of them, and there were just too many roles she did… I was confused about Kuri Mamiko though, because I knew she played that character, but it seemed like she will be appearing later, but at the showing, I noticed 雪野五月 at the credit. I thought I saw it wrong and look it up, and it turned out to be true, and it was weird."
                }
            ]
        }
    ]
}