{
    "Replies": [
        {
            "ID": "c2fm3cn7f64tkgl40shg",
            "Author": "Daniel Pascua",
            "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 24, 2011 at 4:44 pm",
            "Content": "“Actually, seeing Nanoha really makes me want OreImo to hurry up and stop being delayed.” I think you switched the series. 😉\n\nAnyway, uh, it’s nice seeing your posts every week. It’s pretty much the only regular thing to expect on the blog so far… (I had to say something else so I didn’t feel like a jerk just pointing out a mistake)",
            "Replies": [
                {
                    "ID": "c2fm3cn7f64tkgl40si0",
                    "ParentID": "c2fm3cn7f64tkgl40shg",
                    "Author": "Grant Walker",
                    "ReplyTo": "Daniel Pascua",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "March 24, 2011 at 5:13 pm",
                    "Content": "…I did switch them. How the hell did I do that?\n\nBut uh, yeah man, regularity’s great.\n\nI love regularity."
                }
            ]
        },
        {
            "ID": "c2fm3cn7f64tkgl40sig",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 24, 2011 at 5:47 pm",
            "Content": "Nanoha _is_ technically a seinen series, despite (or maybe because of) its mostly child cast. Fun fact: Meruru’s (and Kanako’s) VA did Nanoha. And apparently Yuuno’s VA did Mami.\n\nNanoha movie was alright (and it was a decent recap of the first season). Biggest problem I had with the original series was how they turned Precia into a complete villain at the end to make it absolutely clear she’s the most despicable person ever so we forget about her and make it easier for the animators to wrap up the plot. There was just something cheesy and forced about the way she kept telling Fate how she hated her in like 15 different ways. They added a lot more backstory in the movie (original TV series had none of Precia’s flashbacks). 1080p lazers was also good.\n\nOn an unrelated note, they’re releasing more Higurashi in celebration of its 10 year anniversary.",
            "Replies": [
                {
                    "ID": "c2fm3cn7f64tkgl40sj0",
                    "ParentID": "c2fm3cn7f64tkgl40sig",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "March 24, 2011 at 5:58 pm",
                    "Content": "Since it’s you saying it, I’ll believe it’s seinen, but I think a young kid could easily sit through the movie and know what was happening. It does so many things I’d expect from a kid’s show that it’s really easy to see it that way, at least from my point of view.\n\nI’m surprised to hear that the movie would have more back story, but I guess that’s cool. But yeah, even a nub like me picked up on how much Precia suddenly seemed to want Fate to realize how much she hated her. It definitely felt overdone.\n\nHigurashi is exciting news, though. Does that mean more novel chapters, or more anime?"
                }
            ]
        },
        {
            "ID": "c2fm3cn7f64tkgl40sjg",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 27, 2011 at 7:00 pm",
            "Content": "IT’S LIKE FUCKING MECHA! WHERE DID THAT LASER COME FROM?!\n\nIn all seriousness though, Nanoha was OK. The beginning was so stereotypical mahou shoujo I don’t even know how to discuss it. Once the story picked up a bit and some fighting commenced though, I could not stop watching. The fights were like fucking mecha. Moar lazorz please. The fights were the only thing that differentiated Nanoha from other mahou shoujo, and even then not by much. Conclusion: if you want a solid mahou shoujo, watch Nanoha. If you don’t like mahou shoujo that much, you’re not really missing anything. I’m with Grant though, I WANT MY FUCKING MADOKA."
        }
    ]
}