{
    "Replies": [
        {
            "ID": "c2fm3df7f64tkgl40sog",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 11, 2011 at 10:17 am",
            "Content": "The thing to remember about Bungaku Shoujo is that there are like 2 or 3 OVAs that cover the “backstory” (for lack of a better word) that came out before the movie. From what I saw, while not playing pokemon or doing German homework, I really enjoyed the show. Or, at least, I’m interested enough to find the OVAs and watch them and the movie through again.\n\n俺の妹がこんあに可愛いわけがない this week was weird. The anime episode was an anime-original story, and it just felt out of place. When I was watching OreImo while it was airing, this was my least favorite episode. Sure, it’s a colossal middle finger to the industry and critics of the show, but it’s just out of place. Thankfully, that’s about as bad as the show gets. I’m pretty sure next week is:\n\nMEEEERU MERU MERU MERU MERU MERU\n\nwhich made my face melt the first time.\n\nAlso, OH. MY. FUCKING. GOD. MADOKA. We were all wrong lol. WHY CAN’T IT BE THURSDAY AGAIN?",
            "Replies": [
                {
                    "ID": "c2fm3df7f64tkgl40sp0",
                    "ParentID": "c2fm3df7f64tkgl40sog",
                    "Author": "Grant Walker",
                    "ReplyTo": "steve",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "March 11, 2011 at 1:20 pm",
                    "Content": "I actually didn’t know that about Bungaku Shoujo. I thought it went straight from the novels to the movie, without any OVA.\n\nKind of wish I’d seen the OVAs now, yeah.\n\nIt was definitely out of place, but I still liked it. I think Gene told me they never even reference Kirino’s anime in future episodes, either, which sort of cements that being out of place, but… yeah.\n\nAnd lolMadoka. That was a fantastic episode. So much shit happened."
                }
            ]
        }
    ]
}