{
    "Replies": [
        {
            "ID": "c2fm44f7f64tkgl40vh0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 25, 2011 at 8:29 am",
            "Content": "NIHONGO WAKARIMASEN. You could also say in plain English that the anime is proof that two bombs just wasn’t enough. That might get you thrown out of Japan though…\n\nChaeha has a better idea of what to buy than I do, but I say get whatever’s cheap. AND NENDROIDS!\n\nThose rooms look awfully nice, I would stay there in a heartbeat. I don’t think Weaver had stoves (for reasons that seem to me to be pretty obvious). Anyway, its nice that you’ve got a pretty nice place there."
        },
        {
            "ID": "c2fm44f7f64tkgl40vhg",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 26, 2011 at 3:39 pm",
            "Content": "Hey, that thing at the top has Korean!\n\nAnyway, whatever you buy, don’t buy loli doujinshi. I believe you could go to jail in America. Or Kodomo no Jikan for that matter.\n\nNendoroids are pretty good choice, but maybe that’s just me.\n\nBlu-ray might be good since Japan and America share Blu-ray region code.\n\nIf it was me, I’d go for figures and games, but that’s just me.\n\nOr go to one of those maid-cafe. Maybe you can also troll otakus there.\n\nHere’s other option. I’d say it’s a traditional thinking, and it would have been what people were doing way way waaaaaaaay back then in Akiba: buying non-otaku related electronics. Maybe you can buy a digital camera and troll otakus with it.\n\nBut seriously speaking, I recommend something that’s rare. Any doujin related stuff (And not limited to hentai stuff. That’s not what doujin is about!) would be pretty rare in my opinion, but if you are not into it like me, it’s worth nothing, so I guess it’s up to you.\n\nBtw, that’s exactly how I felt 4 and a half years ago when I came to America. I’m sure you will feel much better soon."
        },
        {
            "ID": "c2fm44f7f64tkgl40vi0",
            "Author": "Andrew",
            "Image": "http://1.gravatar.com/avatar/f9c601186f16c2d134e34507dd679b83?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 26, 2011 at 6:04 pm",
            "Content": "Black black caffeine hard candies,\n\noh and some of those sake bottles and cups\n\nThat’s probably the only stuff i would actually look for,\n\notherwise impulse buy FTW"
        },
        {
            "ID": "c2fm44f7f64tkgl40vig",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 26, 2011 at 7:08 pm",
            "Content": "こんいちわあああああああ！！！！\n\nバカのアメリカ人ですよおおお！！\n\nHave to enunciate the す too.\n\nor,\n\n俺はナルトだよ。ビリヴいっと！\n\nand wear an orange jumpsuit.\n\nI would end up buying volumes upon volume of manga, just because of how inexpensive it is. Most (yes most chaeha) doujin would be a waste since it’s all censored anyways."
        },
        {
            "ID": "c2fm44f7f64tkgl40vj0",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 27, 2011 at 2:49 pm",
            "Content": "Okay, I don’t know if you will see this or not.\n\nOr, you will have time to go to such a place, but here’s a nice event in February.\n\nIt’s the Sapporo Snow Festival!\n\n[http://en.wikipedia.org/wiki/Sapporo\\_Snow\\_Festival](http://en.wikipedia.org/wiki/Sapporo_Snow_Festival)\n\nHere’s English Wikipedia entry about it. It’s happening Feb 7~13.\n\nSapporo is in Hokkaido, which is really northern, and I guess that’s how they can have a snow festival in February. I was in northern part of South Korea (which was quite close to North Korea) but I hardly saw any snow! And I love snow. To think that a neighboring country had such a festival since 50′s… Urayamashiiiiiiiiiiii. But now I live in Colorado so it’s good now.\n\nOh, did I mention SnowFes 2011 is where they are releasing (or just showing) the new version of Snow Miku Nendoroid? Totally worth it. There’s also gonna be snow sculpture of other stuff too. Crypton headquarter, who created Miku and her pals, are located in Sapporo, too.\n\nAnd appearently SnowFes is as well-received world-widely as Oktoberfest in Germany. It’s not otaku-related if you were wondering. It’s a legit festival.\n\nAnd there’s this figure convention called Wonder Festival, and Winter WonderFest 2011 is being held on Feb 6th. It’s basically figure version of Comic Market, so I don’t really recommend going there unless you feel like you are a dedicated figure otaku. (like me!)\n\nAnyway, here’s some links about WonderFest\n\n[http://www.kaiyodo.co.jp/wf/](http://www.kaiyodo.co.jp/wf/) (official website)\n\n[http://en.wikipedia.org/wiki/Wonder\\_Festival](http://en.wikipedia.org/wiki/Wonder_Festival) (Wikipedia article)\n\nI added WonderFest just in case, but it would be such a waste if you miss SnowFes in Sapporo, although I don’t think you’d have time to go all the way up to Hokkaido.\n\nP.S: To Steve. Censoring in doujin doesn’t matter to me cause that’s not why I like doujin. I like doujin because it’s amateur made and good, like Touhou (not the hentai manga. I mean the games!) for instance.",
            "Replies": [
                {
                    "ID": "c2fm44f7f64tkgl40vjg",
                    "ParentID": "c2fm44f7f64tkgl40vj0",
                    "Author": "Chaeha",
                    "ReplyTo": "Chaeha",
                    "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 27, 2011 at 3:00 pm",
                    "Content": "The second sentence means that I don’t know if you will have time to go there. It looks confusing even though I wrote it. And I don’t know Why I can’t edit my own comment."
                }
            ]
        },
        {
            "ID": "c2fm44f7f64tkgl40vk0",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 28, 2011 at 10:59 am",
            "Content": "Pretty nice living arrangements, looks like. The class building is sketchy as hell, though. I mean… whose idea was that? I almost wish the inside LOOKED like a warehouse, like those giant rooms they used stuff you in to take AP tests in high school."
        }
    ]
}