{
    "Replies": [
        {
            "ID": "c2fm3277f64tkgl40rbg",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 3, 2011 at 11:46 pm",
            "Content": "I should watch RoD sometime. Heard it was really good.\n\nI’m not really sure why Koe de Oshigoto made the Disturbia Night playlist, but oh well. I can’t really say that it’s that good, but I’ve admittedly never seen the premise before, and it doesn’t come out often enough to hate. And obviously, there’s tons of potential for crude jokes. And it makes me honestly wonder about things that I should probably not wonder about. Like condensed milk.\n\nMirai Nikki is actually the show I look forward to most every week (sorry Fate/Zero). It’s got a really annoying protagonist (I’m getting kinda sick of these “boku wa” spineless protagonists), and survival game plots have done before. But Yuno is such an awesome character that she makes up for everything else. I usually don’t really like yandere characters, mostly because they always seem so overdefined by that trait. Yuno, however, feels a lot more complex than that. She’s fucking crazy, sure, but that’s really not all. She gets happy, and angry, and embarassed, and serious, and philosophical, and they all feel like genuine parts of her personality. Not everything she does is painted by insanity, and that makes her feel like an actual character. I know there’s a lot of controversy to the manga ending (which I’ve never read), but I guess I’ll wait and see how things turn out.\n\nPerfect Blue was interesting in the way it was written, and I liked the way it made the viewers just as unable to distinguish illusion and reality as Mima was. As Matt noted, it does get a bit overbearing, but I think the completely lack of subtlety and somewhat frustrating Inception-esque layering is intentional. On a side note, it’s always amusing to watch things from the ’90s and bathe in technological nostalgia. The old Macintosh with its bootup sound, the old internet, walkmen, and boomboxes. Also, lol Schrodinger’s fish."
        },
        {
            "ID": "c2fm3277f64tkgl40rc0",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 4, 2011 at 1:24 pm",
            "Content": "First of all, as you know I love to say things about little, unimportant stuff, “ge” in “eroge” already means game, so “eroge game” would be “erotic game game.”\n\nAnd I’m not really an eroge/VN otaku. Just a seiyuu(VA) otaku. Well, I guess I play some VN’s too. But I don’t think I’m at a level where I could be called an otaku. Maybe doujin game otaku. Man, I was born in the wrong country. It should have been little (maybe a lot) more east.\n\nAnyway, R.O.D is pretty good. I really liked OVA, but not so much of the TVA. That’s when I didn’t know anything about Japanese VA, and now, since I found out that Nonaka Ai and Saito Chiwa was in the TVA, I might watch it again."
        },
        {
            "ID": "c2fm3277f64tkgl40rcg",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 9, 2011 at 10:59 am",
            "Content": "Pretty much what Chaeha said. R.O.D. OVA was really cool. The show not so much, but it’s not bad or anything.\n\nI’ve been looking forward to Mirai Nikki as well… Fate/Zero is cool-looking and all, but it’s a battle anime. Mirai Nikki seems a bit more interesting than that, all-in-all, even though it does some stupid things I don’t like (Ninth pulling a motorcycle out of her ass, reanimating corpses in the 4th episode, etc.). It still has a lot more good than bad, though, so I’m looking forward to it.\n\nI enjoyed Perfect Blue, if that’s the right word. It was kind of distressing to watch sometimes, but overall I thought it was pretty well done."
        }
    ]
}