{
    "Replies": [
        {
            "ID": "c2fm1rv7f64tkgl40o50",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 18, 2010 at 1:05 pm",
            "Content": "Sounds about right. 🙂\n\nI’m trying to finish house of five leaves, I’ll be watching it over break. I haven’t heard much about how it ends so we’ll see if its worth a watch or not. Besides that, I have a lot of other anime to finish, like Garden of Sinners.\n\nAwesome review, thanks for doing them this semester Grant! 😄"
        },
        {
            "ID": "c2fm1rv7f64tkgl40o5g",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 18, 2010 at 1:14 pm",
            "Content": "Unashamedly, I grabbed Sex Jokes: The Anime. I know I’ll get bored of it at some point, but my expectations for it lie somewhere around “make me laugh for a couple hours.” It does handle its comedy better than one might expect; the timing on jokes is well executed most of the time.\n\nAmagami was very … average, I guess I could say. In a good way, though. I couldn’t find anything particularly engrossing/unique to the show, but it still held my attention. I suspect I’ll come back to it once I ~~run out of~~ get bored of Sex Jokes: The Anime. Might be a good thing to watch over Christmas break.\n\nHoFL. Hmm. I suspect I couldn’t get into it because of the slowness you mentioned, and it couldn’t have helped that I was feeling tired by that point, either (then I broke out my laptop and my attention was totally gone). I can totally dig the art style, though; I love shows that go for a “different” sort of look (Tatami Galaxy, FLCL, Katanagatari, etc).\n\nRelatedly, I heartily recommended Samurai Champloo to anyone who hasn’t seen it yet. Hip-Hop Samurai Anachronism Mashup. Very fun.",
            "Replies": [
                {
                    "ID": "c2fm1rv7f64tkgl40o60",
                    "ParentID": "c2fm1rv7f64tkgl40o5g",
                    "Author": "Gene",
                    "ReplyTo": "Jack",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "November 18, 2010 at 1:49 pm",
                    "Content": "Sex jokes was definitely better than the alternative. We almost showed Working!!!; also based on a 4-panel comic strip, but far worse."
                }
            ]
        }
    ]
}