{
    "Replies": [
        {
            "ID": "c2fm2rf7f64tkgl40qpg",
            "Author": "Zhen",
            "Image": "http://0.gravatar.com/avatar/69b0c07a7acb85f80a459d85dd1074b3?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 23, 2010 at 9:34 pm",
            "Content": "God dang it, Gene. You have such terrible taste. Why did I click every youtube link?",
            "Replies": [
                {
                    "ID": "c2fm2rf7f64tkgl40qq0",
                    "ParentID": "c2fm2rf7f64tkgl40qpg",
                    "Author": "Gene",
                    "ReplyTo": "Zhen",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 24, 2010 at 10:29 am",
                    "Content": "SPINMAID!!! Spinmaid…"
                }
            ]
        },
        {
            "ID": "c2fm2rf7f64tkgl40qqg",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 23, 2010 at 9:53 pm",
            "Content": "Haha, excellent list. Despite the fact I haven’t really seen half of it. 27 shows this year, eh? Well, if we assume half were 13-episode and the other were 26 (an average of 19.5 episodes a show), that you finished each show, that you watched each episode in its entirety (24 minutes), and spent 1 minute afterwards reflecting/complaining/etc (25 minutes total per episode), you wasted about 9 days this year on anime. I’d make a condescending remark concerning your productivity, but I don’t think I was that much better.\n\n74-episode Angel Beats? Hell, I’d watch that, if it meant I got to see every character’s story in full detail. Not to mention having an excuse to watch the OP and ED 74 times. As for learning the OP on piano, do you mean you specific arrangement of it w/ sheet music, or just a general play-it-by-ear method? If the former, hit me up. If the latter, it’s not too tough 😛\n\nI totally remember _Are You Afraid of the Dark?_, I used to watch it all the time.\n\nTatami Galaxy was awesome, but I think I went over that in a previous post. For anyone who hasn’t watched it, go watch it.\n\nBaka to Test is probably one of the funniest shows I’ve seen, up there with FMP Fumoffu? and Azumanga Daioh. Not to mention that it spawned an entirely new sexual orientation. It’s terribly confusing seeing a picture with both of the Kinoshita twins in it and trying to guess the trap. Did you fap to the wrong one? Are you gay? YOU’LL NEVER KNOW!\n\nLol at OreImo ranking at #1, but really, it was a great show. Definitely looking forward to the BD release this summer. Meeerumerumerumerumerumerume~!\n\nAs for Seikon no Qwaser…I have to agree it’s probably the worst thing I’ve seen at showings outside of Bad Anime Night (still remember watching the first episode uncensored during last E-Days). Almost sorry I dragged Kurt to it, but then we showed DMC, so it was alright.\n\nPersonal top 10 is in the works. I swear.",
            "Replies": [
                {
                    "ID": "c2fm2rf7f64tkgl40qr0",
                    "ParentID": "c2fm2rf7f64tkgl40qqg",
                    "Author": "Gene",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 23, 2010 at 11:27 pm",
                    "Content": "HIDEYOSHI IS HIDEYOSHI. LOGIC!\n\nI’m trying to play “MAH SOUL UR BEATZ” by ear, but I’d love to just see the cheat sheet (i.e. music). Plz help I have to play at a church on the 8th and I’d love to troll everyone by playing that.\n\nGoshdarnit I need to stop watching anime. JUST TWO MORE SEMESTERS I SWEAR. Looking forward to your top 10 Chris, I wish I could proofread. Looking at the Amagami bit is giving me a headache already.",
                    "Replies": [
                        {
                            "ID": "c2fm2rf7f64tkgl40qrg",
                            "ParentID": "c2fm2rf7f64tkgl40qr0",
                            "Author": "Chris",
                            "ReplyTo": "Gene",
                            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "December 23, 2010 at 11:36 pm",
                            "Content": "Since attempting to transcribe music with text is impossible (“yeah yeah it goes like du-dun-dun-dun-duuuuuun and it goes like b-minor to g to d-on-f# you get that”), I did a quick google search and found some sheet music.\n\n[http://server.agarrado.net/animemusic/angel-beats-my-soul-your-beats.pdf?AWSAccessKeyId=AKIAJOOUXNQVYS467B6Q\u0026Expires=1293172565\u0026Signature=VHmqPxIvozLz4pS2%2FNt%2FUAUaZ%2Fo%3D](http://server.agarrado.net/animemusic/angel-beats-my-soul-your-beats.pdf?AWSAccessKeyId=AKIAJOOUXNQVYS467B6Q\u0026Expires=1293172565\u0026Signature=VHmqPxIvozLz4pS2%2FNt%2FUAUaZ%2Fo%3D)\n\nBest of luck.",
                            "Replies": [
                                {
                                    "ID": "c2fm2rf7f64tkgl40qs0",
                                    "ParentID": "c2fm2rf7f64tkgl40qrg",
                                    "Author": "Chris",
                                    "ReplyTo": "Chris",
                                    "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                    "Date": "December 23, 2010 at 11:42 pm",
                                    "Content": "Bah, since it looks like that link is acting up, try this one [http://josh.agarrado.net/music/anime/](http://josh.agarrado.net/music/anime/) and just click on Angel Beats.",
                                    "Replies": [
                                        {
                                            "ID": "c2fm2rf7f64tkgl40qsg",
                                            "ParentID": "c2fm2rf7f64tkgl40qs0",
                                            "Author": "Gene",
                                            "ReplyTo": "Chris",
                                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                            "Date": "December 23, 2010 at 11:59 pm",
                                            "Content": "Aaaaa! They have Kimi no mama de! Thanks Chris!"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm2rf7f64tkgl40qt0",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 23, 2010 at 10:50 pm",
            "Content": "Oh boy, I’m gonna get so much shit for this. Honestly, I thought OreImo was a trainwreck. So **horrible**, but I just couldn’t look away for some reason. The two lead characters are all but unlikeable, no one shows any growth/change/depth (Kirino showed a tiny, tiny hint of it in ep11), the plots are contrived (see: Kirino’s novel), and the show ends on a weird anticlimax after yet another subplot that comes out of nowhere. Hopefully the “True End” can salvage it a bit, but I’ll mostly be watching for the supporting cast. And ep6. \u003c3 ep6.\n\nOn to other things!\n\nIt occurs to me that this summer was the first time I actively \"followed\" a series after seeing the season lineup. Previously, I just picked up shows after the fact via word of mouth from friends or the internet. I feel … \"qualified\" as an anime geek now. **;\\_;**\n\n74 episodes of Angel Beats, eh? That’s only a little longer than the good part of Bleach. If it maintained the quality level, I probably could have slogged through that. If it wouldn’t have absolutely bankrupted P.A. Works, a 26-episode run would have been the sweet spot for it, IMO. The extra episode is out now, too, although I’m not sure if there’s a 720p anywhere at the moment. Definitely waiting on that.\n\nKuroko’s pretty funny in Railgun. Something about her voice just seems so right for her personality. Even better, though, was having her characterization associated with her seiyuu when I watched Okami-san to Shichinin no Nakama-tachi make the Narrator’s lines 10 times funnier when I imagined Kuroko delivering them.\n\nI guess I’ll put together some thoughts on shows I’ve watched from this year too. Probably haven’t seen enough to put together a full top-10, so I’ll settle for making a top three and listing the rest.",
            "Replies": [
                {
                    "ID": "c2fm2rf7f64tkgl40qtg",
                    "ParentID": "c2fm2rf7f64tkgl40qt0",
                    "Author": "Gene",
                    "ReplyTo": "Jack",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 23, 2010 at 11:23 pm",
                    "Content": "No no no, your opinion is understandable. I’ve never seen a show so quickly polarize /a/ between brilliance and absolute insufferability. On the plus side, it led to some [pretty awesome threads](http://i51.tinypic.com/5d5jkw.jpg). Really? Episode 6? Episode 10 was easily mine. N-NOT THAT THAT MATTERS OR ANYTHING. WHY ARE YOU BEING SO FRIENDLY? Kimoi…\n\nAye, a 26 ep run would’ve been the beautiful compromise. 74 episodes is just Maeda Jun covering a year (and progressively bankrupting PA Works, of course). Also you’re not imagining things, there’s no 720p rip and the standard definition one hurts my eyes.\n\nKuroko’s funny in railgun and Index II. I prefer Index II but I’ll take either. BAZINGA!"
                }
            ]
        },
        {
            "ID": "c2fm2rf7f64tkgl40qu0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 24, 2010 at 12:05 am",
            "Content": "Not good enough for its own post, but semi-related. I just got this for my ipod touch:\n\n[http://www.youtube.com/watch?v=aZYSiQV\\_BlA](http://www.youtube.com/watch?v=aZYSiQV_BlA)\n\nAAAAAAAAA WHAT AM I DOING."
        },
        {
            "ID": "c2fm2rf7f64tkgl40qug",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 24, 2010 at 1:19 am",
            "Content": "The LIST. I want to say I like it, but like Chris, I’ve only seen about half of it. Glad to see Tatami Galaxy and Amagami-SS both placed so high. Since I haven’t seen the top two shows I’ll just pretend Tatami placed on top…\n\nMore seriously, though, I enjoyed the read. And yes, I do remember Are You Afraid of the Dark?, if only so vaguely. I think I stuck with Goosebumps as a child more because the other would legitimately scare me, and I’m not good at SCARY THINGS.\n\nI’m kind of surprised Seikimatsu placed on the list, too, so that’s a show I may have to revisit. I think I plan on giving each of the shows I haven’t seen a fair shot too, though, since I have heard good things about a couple of them. There are too many I have to see, blahhh…\n\nAlso, I’m proud(?) to say that I’ve never seen Seikon no Qwaser. So I can’t exactly offer any sort of opinion on it, but considering that little horror story, I don’t need to.\n\nAnd while I’m reluctant to say that a full-blown 74-episode Angel Beats! would have been _better_, I do rather yearn for a more fleshed-out cast of characters. I probably would have ended up watching most of it (I want to say I would watch it all but I still haven’t seen all of Monster, an arguably superior show, at least in my humble view).\n\nEnjoyed the list, though, like I said. Looks like we just wait on Chris, now.",
            "Replies": [
                {
                    "ID": "c2fm2rf7f64tkgl40qv0",
                    "ParentID": "c2fm2rf7f64tkgl40qug",
                    "Author": "Chris",
                    "ReplyTo": "Grant Walker",
                    "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 24, 2010 at 12:27 pm",
                    "Content": "Nah, we’ve got to wait for Chaeha’s list too.\n\nYou _are_ making a list, right Chaeha?",
                    "Replies": [
                        {
                            "ID": "c2fm2rf7f64tkgl40qvg",
                            "ParentID": "c2fm2rf7f64tkgl40qv0",
                            "Author": "Chaeha",
                            "ReplyTo": "Chris",
                            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "December 27, 2010 at 6:50 pm",
                            "Content": "I just noticed you were doing best anime of 2010. Hmm, gotta work on it. Will be done in few days. Sorry for being late.",
                            "Replies": [
                                {
                                    "ID": "c2fm2rf7f64tkgl40r00",
                                    "ParentID": "c2fm2rf7f64tkgl40qvg",
                                    "Author": "Gene",
                                    "ReplyTo": "Chaeha",
                                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                    "Date": "December 27, 2010 at 9:25 pm",
                                    "Content": "That’s great Chaeha! You have 4 days…\n\nI’m just kidding. You have all of break. :3"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm2rf7f64tkgl40r0g",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 29, 2010 at 5:42 pm",
            "Content": "SO MANY TOP 10 LISTS… I have so much reading to do lol\n\nI figured I would post in this one because it talked about the PSG soundtrack (psst WHICH I HAVE AND AM WILLING TO SHARE =D).\n\nI feel like AngelBeats could have done much more if Key took their time with it. Clannad is 48(?) episodes all told and it’s appropriately spaced. At least we get another season of AB this coming year lol. Where the feck is B Gata H Kei? That show made me laugh so hard every episode. Consistent and funny.\n\nAlso… all of you are high for not having Shiki at #1. Best show I’ve ever seen, or maybe I like psychological/mystery shows too much… Oreimo at 1? lol gene… lol… It’s good but…\n\nSo next year we get season 2 of AngelBeats, Seitokai Yakuindomo (sexjokes, the anime), and The World God Only Knows. Also the “True End” of Oreimo and a series of OVAs for YnS that will be OVAs for obvious reasons. More Black Lagoon too. Don’t forget Hellsing: Ultimate 8! (lol jk… it’s never coming out).",
            "Replies": [
                {
                    "ID": "c2fm2rf7f64tkgl40r10",
                    "ParentID": "c2fm2rf7f64tkgl40r0g",
                    "Author": "Gene",
                    "ReplyTo": "steve",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 29, 2010 at 11:35 pm",
                    "Content": "B Gata H Kei isn’t on there for the same reason Seitokai Yakuindomo isn’t on there, and that is because of all the sex. PARTICULARLY THE LACK THEREOF (trollface)\n\nBy that line of logic YnS should’ve been on there butI’ve never seen that show ever so it’s not on there. That being said, the sora arc was the best thing I’ve never seen.\n\nI keep forgetting about Black Lagoon and how I like that show. Thanks for reminding me, I need to catch up on that. There have been a few OVAs or another season or summat… right?",
                    "Replies": [
                        {
                            "ID": "c2fm2rf7f64tkgl40r1g",
                            "ParentID": "c2fm2rf7f64tkgl40r10",
                            "Author": "steve",
                            "ReplyTo": "Gene",
                            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "December 30, 2010 at 3:39 pm",
                            "Content": "PSG Season2\n\nGainaxtrollface.jpg"
                        }
                    ]
                }
            ]
        }
    ]
}