{
    "Replies": [
        {
            "ID": "c2fm2nn7f64tkgl40qhg",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 24, 2011 at 3:24 pm",
            "Content": "Nothing should get in my way of getting to the showing on time next week, so I’ll be able to actually see the OreImo episodes that time.\n\nFor Trigun, as soon as I saw one dude fought with a lightning-arm-cannon and another fought with a cross-shaped multigun, topped off with the genki insurance muscle girl, I gave up on taking it seriously. This, together with me not knowing who was who, left me not caring about anyone or anything in the movie at all. I get the feeling that people who had watched the series would get more out of it (someone’s backstory or character traits were probably explored more deeply or something), but as a fresh viewer (coming in late, no less) the movie left me unimpressed as well.\n\nBut hey, it’s shounen. There was a dude shooting robots with lightning and a guy who stole everyone’s bullets. Which is awesome. MST3K Mantra, go!\n\n\\****\n\nI don’t play Starcraft at all, but even I could tell how bullshit Gene’s victory was. Troll to the Finish!"
        },
        {
            "ID": "c2fm2nn7f64tkgl40qi0",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 24, 2011 at 4:51 pm",
            "Content": "Well, somehow, I feel like defending Trigun for some reason even though I never watched it. I guess I’m just an Asian who has enjoyed old shounen stuff, and feel kinda sad that almost no one cares if there’s no “moe” now.\n\nI’m not saying you’re like that.\n\nAnd I’m not saying I hate moe. In fact I love them. I guess I like them both.\n\nFirst, you gotta take account that Trigun’s pretty old.\n\nI mean, the movie is 2010, but the original series (the manga) started serializing in 95.\n\nI don’t know if you’ve read any shounen manga around that time, but I know I used to read whole bunch of “new releases” when I was in elementary school, which is few years after that.\n\nBack then, all the shounen mangas were in that style. Well, I guess not much have changed for shounen. It’s all those moe stuff that’s different now compared to 90′s.\n\nOne Piece started in 97, so that could be why you feel like it’s One Piece.\n\nAnd I think Vash’s no-one-dies-in-my-sight goes deep in the original series. I think it’s one of the central plot somewhere.\n\nThough I agree that movie was not good. Or, I should say “not good enough.”\n\nThere were some parts that could have been better. Like Amelia’s back story.\n\nAmelia turning out to be Gasback’s kid kinda back story was done a little too much.\n\nThey should have come up with something better.\n\nTo me, Trigun movie was what could have been great, considering the source, but couldn’t go far enough. I guess that’s pretty much what you said. I don’t know what I was trying to say anymore."
        },
        {
            "ID": "c2fm2nn7f64tkgl40qig",
            "Author": "Chris Lee",
            "Image": "http://0.gravatar.com/avatar/0c2d6c5d4e840c55a28a155fdb5d0340?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 24, 2011 at 8:32 pm",
            "Content": "Definitely one of the better OreImo episodes. Kyousuke’s confrontation with Gen-dad is hilarious. Not to mention more Kuroneko. Definitely look forward to next week’s showing.\n\nAs for Trigun, I can see where you’re all coming from. It’s by no means a masterpiece – hell, by my own standards nowadays, it’d barely register as a blip. It’s classic shounen, with improbable action, idealized romance, cookie-cutter characters, and oh-look-everyone-is-angsting. But Trigun was one of the first anime I watched and finished, and I guess it’s got a special place in me. I know it’s all really superficial, but…I dunno. Sometimes I’ve just gotta drop my heavily jaded tastes and watch anime like a casual, clichés and terrible plot twists and all.\n\nMore importantly, MADOKA 8 fdjfl;akjfasdfls;djfasdf go fasteeerrr",
            "Replies": [
                {
                    "ID": "c2fm2nn7f64tkgl40qj0",
                    "ParentID": "c2fm2nn7f64tkgl40qig",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris Lee",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "February 24, 2011 at 9:09 pm",
                    "Content": "I do know what you mean. You mentioned Rurouni Kenshin, and that’s kind of special to me because it’s the first manga I read all the way through. I similarly enjoyed the anime, and it’s probably always going to be memorable for that reason, so I get what you’re saying.\n\nIt’s probably better for me that I haven’t watched Kenshin in a while, now that my tastes have ‘developed’ a little bit. I’d probably like Trigun if I just treated it like a shounen anime and went with it. Still haven’t seen the show, so!\n\nAnd yes, Madoka.. when the hell, man.",
                    "Replies": [
                        {
                            "ID": "c2fm2nn7f64tkgl40qjg",
                            "ParentID": "c2fm2nn7f64tkgl40qj0",
                            "Author": "Gene",
                            "ReplyTo": "Grant Walker",
                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "February 25, 2011 at 3:10 am",
                            "Content": "I know that feel bro, I know that feel"
                        }
                    ]
                }
            ]
        }
    ]
}