{
    "Replies": [
        {
            "ID": "c2fm1nf7f64tkgl40nsg",
            "Author": "Ryan Settergren",
            "Image": "http://0.gravatar.com/avatar/c0ab49e44a7e4c29701518278e1511d4?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 14, 2010 at 3:14 am",
            "Content": "although i did not make this weeks showing, i did recently watch Arakawa on my own time and therefore re-watched the first half or so during the previous showings until i got slammed with tests… I have to say, you pick up a bunch more by re-watching it (especially with the mayor (or village chief depending on the sub group…)), and the comedy doesn’t get old, although this is probably true for most anime series.\n\nbut anyways, I really enjoyed this series. At first Ric just bugged the shit out of me. dunno why, but i just hated his personality. but, in hindsight, that was to emphasize one of the main themes of the series (i guess). blah blah blah\n\nCharacter analysis aside, i concur that the first season didn’t wrap things up nice and neatly. It still makes you wonder what is to come with that “under the bridge” lifestyle. but that is why they announced the upcoming season 2 at the end of the episode (or at least in the end of the episode i watched). just look at code geass for christ sake; season 1 couldn’t have ended in a bigger cliff hanger. the second season will (hopefully) wrap up some of these loose ends/feelings.\n\nand having seen the first episode of season 2 already (and episode 2 being downloaded as i write), you won’t be disappoint.\n\nthis reply/review/whatever the fuck you would call it is probably longer than most papers i have written. not sure if its procrastination or my love for this series that inspired me to write so much (especially since i tend to write as little as possible). probably a mix of the two… so sorry if its choppy or confusing or boring or repetitive or uses excessive conjunctions or such. its 3 am and i have to get up for class ~~at 2~~.\n\nnow i should probably be getting to studying for that diff eq test tomorrow…\n\nor sleep.\n\nor watch that 2nd episode of Arakawa under the bridge x bridge. whatever."
        },
        {
            "ID": "c2fm1nf7f64tkgl40nt0",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 14, 2010 at 1:29 pm",
            "Content": "There’s definitely a sense of incompleteness to Arakawa at the moment. I keep expecting Ko to have a grand epiphany about the people living Under the Bridge, but so far it’s been very subtly creeping in bit by bit instead of all at once, which is sort of refreshing, but it’s still not there yet. Also, since they managed to slip in the “Season 2 Greenlit!” bit at the end, I wonder if they knew ahead of time that they could put off a certain amount of resolution until the second season?\n\nOn a different train of thought, every time I read the “Bridge x Bridge” title I think of a bridge standing straight up on end. Goddamn vectors."
        }
    ]
}