{
    "Replies": [
        {
            "ID": "c2fm36f7f64tkgl40rsg",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "May 3, 2011 at 1:13 pm",
            "Content": "I noticed there weren’t any comments on this and got kind of confused, since I figured there’d be some…\n\nAnyway, since it sounds like you’ve already gotten started on this game it’d be cool to see what it looks like, how it plays, etc. Seeing the calculator RPG would be pretty neat, too!",
            "Replies": [
                {
                    "ID": "c2fm36f7f64tkgl40rt0",
                    "ParentID": "c2fm36f7f64tkgl40rsg",
                    "Author": "Daniel Pascua",
                    "ReplyTo": "Grant Walker",
                    "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "May 3, 2011 at 7:58 pm",
                    "Content": "Actually, it’s a game I’d like to make if I could make some kind of large scale (possibly MMO)RPG with nice graphics and maybe motion control, but I haven’t had any ideas for it using just what I can do now, so for now it’s just a story.\n\nAs for the calculator game, it’s still on the calculator I use regularly. When I look back on it, I have my doubts about the story (don’t like the writing anymore, couldn’t portray the characters in the way I intended, the plot couldn’t be properly explained…), but that’s how I am about a lot of things. I thought it was all right at some time, so… The game portion is still pretty fun. The story was adjusted to make more of a game, and shortened because of the limited memory on the TI-83 (the entire program’s 50000 bytes or so, which is really big considering you can only have 20000 bytes unarchived at once, and the total memory is only around 100000 bytes probably)."
                }
            ]
        }
    ]
}