{
    "Replies": [
        {
            "ID": "c2fm3gf7f64tkgl40tc0",
            "Author": "dante",
            "Image": "http://1.gravatar.com/avatar/b0a5ad3c3df8b9534c485dda177c729c?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 18, 2011 at 1:46 pm",
            "Content": "Eh, I’ll take over if you can’t do this anymore, Grant. I know good, meh, and awful when I see them. I’ll probably have them up by the end of Wednesday, too.\n\nI’ll probably look into Dat Flower and Kami-sama no Memo-cho, since they seem to have consistently good writing and style. However, I’ll hold off on Kami-sama Dolls until the jury’s in. I don’t want to waste my time like I did on No. 6.\n\nAs for No. 6. When you say it wasn’t awful, let me be the first to point out that the first 3 episodes is about as good as this show gets (aside from episode 10 of 11). Too much gets introduced, nothing is explained, the characters are beyond forgettable/ annoying, the symbolism is etched into your retinas, and the ending is garbage. Overall, I can easily mark No. 6 as Studio BONES’ worst series to date, as well as the worst series to ever to broadcast in the Noitamina block. All I can say is that I’m glad they are switching to a 24 episode format.",
            "Replies": [
                {
                    "ID": "c2fm3gf7f64tkgl40tcg",
                    "ParentID": "c2fm3gf7f64tkgl40tc0",
                    "Author": "Grant Walker",
                    "ReplyTo": "dante",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "September 18, 2011 at 2:00 pm",
                    "Content": "Okay. Why not. We all know you can hate better than I can, Matt. I gracefully step down, haha.\n\nAnd I guess that’s a good reason not to watch any more of No. 6. I’ll take it to mean nothing cool happens later on."
                }
            ]
        },
        {
            "ID": "c2fm3gf7f64tkgl40td0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 20, 2011 at 1:34 am",
            "Content": "I’m finally commenting on this!\n\nHidan no Aria is simply doing it wrong. I haven’t watched it all, so I can’t make absolute statements about it, but from what I saw (4 episodes), it was trying to build bridges with a tractor. Everything about the show is set up for a light fanservice show with some action on the side, maybe some drama here and there. Something basic, but not unenjoyable, like Raildex. Then it ended up going the “srs bzns” route, and flopped. To be honest, my favorite part of the show was when Kinji slipped into Hysteria Mode in the first episode, and it never happened again. A show needs to know what to capitalize on to be successful, even if it’s something as stupid as fanservice, and Hidan No Aria didn’t do that.\n\nLegend of the Legendary Heroes, as you pointed out, relied too much on shock value. The shift in tone was too abrupt, and instead of being jarring, it was just confusing. Like purple noodles bursting out of your wall, or something. I think stuff like this needs to have some buildup – not too obvious, or you give away the punchline, but not so random, or it feels gimmicky. Which LotLH felt like. Granted, it was kind of amusing watching Ryner (was that his name?) lolraep the goons, but that doesn’t last.\n\nNo. 6 was just…boring. I don’t know. The not-so-subtle BL overtones were sketchy, but they’re not why I didn’t care for the show. Everything about it just feels uninspired. Like it’s filler material whose sole purpose is to bring in some profit. It didn’t help that the soundtrack was spectacularly bad. A show’s gotta hook the audience in the first 2-3 episodes, and No. 6 didn’t really do that.\n\nNow that I’ve finished complaining about the stuff I didn’t like:\n\nAno Hana was one of my favorite shows from the spring. But unlike Grant, I don’t know I’d be so quick to recommend it to people. It was one of the possibilities for the featured show this semester, and despite how much I liked it, I was the one who shot it down. Simply put, I think this is a bit of a love-it-or-hate-it show. It had one very strong point, and a lot of smaller flaws. If you can buy the strong point, it can be an amazing show, but if not, it can quickly degenerate into a mess. There was a lot of discussion about this show on the webz as it aired, and the dissenters had a few good points – some of the drama is forced, and there are a few plot holes that can’t be well explained. And they’re points I can’t refute. But the character cast was Ano Hana’s shining point, and they were so vivid and…realistic, that I could forgive the show for all of its mistakes. I don’t want to say too much here, partly because of spoilers, and partly because I’m pretty sure Ano Hana will be on my Top 10 of 2011, and I’ll talk more about it then.\n\nKamisama Dolls is something I’m (trying) to follow this season, and at this point, I’m still not sure if it’s just because I really love the OP and ED. As I’m sure many of you are painfully aware of, Ishikawa Chiaki is my favorite Japanese vocalist, and anything she’s involved in instantly gets biased brownie points. Also, I think Utao is adorable, and I don’t say that about many characters (I think it’s her facial expressions). And…that’s about it. The plot and character cast isn’t particularly amazing, just decent.\n\nKamisama no Memochou is the only other show I’m following this season (besides Baka Test 2, and Usagi Drop which I’m planning to watch eventually). It’s pretty interesting – kind of like an urban version of Gosick. The first episode gives off “Denpa Teki” vibes based on the rather dark nature of the theme, but it sheds that skin and becomes more light-hearted (as far as I know, which is 6 episodes). Also, the soundtrack is good. Derp."
        }
    ]
}