{
    "Replies": [
        {
            "ID": "c2fm3p77f64tkgl40uh0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 1, 2012 at 1:50 am",
            "Content": "Nisemonogatari is something that wouldn’t be for everyone, much like Bakemonogatari wasn’t, as it is extremely dialogue heavy, not to mention there’s a metric fuckton of fanservice. It gives up traditional pacing and plot development for witty banter and off-kilter characterization. Nothing really _happens_ most of the time, which can lead to some frustration when simple plot points take multiple episodes just for the show to get around to them (kinda like students and homework). It’s also a sequel, and while it does a respectable job providing exposition to its predecessor, it certainly helps to have watched Bakemonogatari to really understand the relationship Koyomi has with all of the girls. I really like it, as the strange animation and funny dialogue cater to my interests, and Bakemonogatari _was_ one of the most popular shows of its season, but it might not be everyone’s cup of tea. Hey, you gotta take what you get, what with this season holding out on the quality.\n\nI’ll be the first to admit I was paying zero attention to the middle two shows in favor of Scumbag Anime Trivia, so I’ll defer to Matt.\n\nThermae Romae was an incredibly amusing show, working its humorous juxtapositions and awkward settings quite well. Timing and flow is key in comedy, and it’s important to order jokes correctly and move on, never lingering too long on any single punchline (something Kill Me Baby didn’t really read in the manual). Nothing should require explanation, and the humor should come from the situation itself rather than a literal punchline or forced joke. As Matt points out, Thermae Romae does this unusually well. If comedy can do this, it needs nothing else – the animation and sound just really need to not detract from it. In this case, it was perfectly suited for the source material."
        }
    ]
}