{
    "Replies": [
        {
            "ID": "c2fm2tv7f64tkgl40r20",
            "Author": "dante",
            "Image": "http://1.gravatar.com/avatar/b0a5ad3c3df8b9534c485dda177c729c?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 5, 2014 at 9:31 pm",
            "Content": "Your Top 10 review is 3 months late, yet still one month early? What is this shit? We run a tight ship around here!\n\nTime for thoughts (not FEEEEELS!):\n\n10: You mean not any of those OTHER video game shows made the cut? It’s a shame that studios must have “passion” just to make a reliable adaptation. And by “passion,” I mean a violently rabid fan base.\n\n9: So moe, even Brolly couldn’t keep them out of the door.\n\n8: Does it and shows like Nichibros become funny because it imitates real life so well, or does it become stale because it doesn’t feed the escapist realism that we’ve come to practically demand from anime? Mmmm, deep.\n\n7: Sometimes “deep” walks a fine path between subtle, dramatic, and melodramatic. When you hit melodramatic, “deep” becomes “loldeep.” That was this. Also, cards.\n\n6: The robots, Indians, and squids were supposed to unite against our common enemy: the jellyfish. Sadly, it never came to be. Then everyone died.\n\n5: You’ve found your Hentalia, Gene. We’re all…so proud…\n\n4: Why don’t the evil robot spaceships go Topless?\n\n3: Ah Derpenronpa, where almost no one gets character development. I wonder if the producers had to justify to anyone how a survival game with 15 people takes 13 episodes. Like many other seasons, 2-cour would have fleshed the show out much better. But then Uni-kun would ruin it all with a couple bear puns.\n\nAlso, Junko derp. This show was severely lacking in Junko derp.\n\n2: Dropped in Episode 2 for including a jellyfish. Besides, everything Gen makes is a plot device. Even plotless Illyasviel.\n\n1: So about that “passion…” Regular passion involves rabid fans. JoJo passion requires rabid fans, you, and gunpoint.\n\nLet’s see how long before anyone else notices your article. \\*Breaks out calendar\\*\n\nHow’s your June?"
        }
    ]
}