{
    "Replies": [
        {
            "ID": "c2fm3jv7f64tkgl40tr0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 19, 2010 at 2:00 pm",
            "Content": "Aye, the law is being dubbed the “anti-moe” law on 2ch. But, let’s face it, this may bring an end to a lot of cancer that’s out there right now. Not to say Yosuga no Sora is cancer. Quite the opposite, actually. It should be noted that it aired probably the most risque episode the week the bill was passed, and that was some major brownie points in my book.\n\nEveryone keeping up with the law should know that the reverb from this law is already being felt amongst publishers everywhere in Tokyo. One writer for BL comics already got turned down. Is this a good thing? Just the same conclusion Chris came to, WHO KNOWS?\n\nLet history decide if this law is a good thing or not. In the short term, chances are a lot of anime producers may export their fanservice elsewhere. As Chris said, South Korea is already looking pretty good. A lot of crying is going on over this issue, but I recommend everyone take a goddamn chill-pill and we’ll just wait and see. For any of you wondering if this affects our anime club, it probably won’t. We always play awful crap and that’s not about to change. \\\u003e\\_O\n\nWinter 2011 is a jacknife in the balls. Not caring at all. I didn’t read your review of Mushi-shi yet because I am also in the middle of watching it (just started after finishing Tatami Galaxy). I’m also starting DRRR!! to see if its “best of 2010″ material or not. I hate 24-episode anime, and in between that and the new Company of Heroes retail beta, the beta already gains priority.\n\nTatami Galaxy was good, though. Definitely glad I watched it."
        },
        {
            "ID": "c2fm3jv7f64tkgl40trg",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 19, 2010 at 3:01 pm",
            "Content": "NO MOAR YOSUGA NO SORA-ESQUE SHOWS =(((((((((((((((((((((((\n\nActually, I doubt that. The eroge and hentai industry has been successful for how long now? It seems to me like this is an “oh no we ‘have to wait three more years’ (wink),” scenario. And even then it’s just loli, incest, and rape… oh wait, that’s all of it.\n\nThe winter season looks like it will be less than engaging (there’s a more up-to-date chart by the way). Bakuman is continuing through the winter. I really like the direction it’s going, so I’ll definitely be watching that. The only show that looks good in a serious way this winter is Gosick. Bones is the production studio for Gosick; Bones also produced Darker than Black and Fullmetal Alchemist, so if you liked those shows you might give Gosick a view. I’ll probably also watch Fractale, Infinite Stratos, and Kore wa Zombie desu ka? (ya, I know it’s deen. FU it has zombies.). Shaft has a maho shoujo coming out as well. I’ll probably stream the first few episodes of this to see if it’s supposed to be a “serious” maho shoujo or if it will be a shaft show. I’m hoping for the shaft option obviously. ‘Onii-chan no Koto nanka Zenzen Suki janain Dakara ne,’ or ‘I don’t like you at all, Big Brother,’ if you’re a weabo is another YnS, so ya, I’m watching it.\n\nIt’ll be a good season for ovas though. We get more Black Lagoon, KnK, MM, and Angel Beats. I’m thinking that winter break is going to be a good time for me to watch the 300+ GB of yet-to-be-watched anime on my hard drive, 14 of which are consumed by the Fate/Stay Night movie (hooray 1080 and FLAC audio) and another 21 of which are consumed by FMA:B."
        },
        {
            "ID": "c2fm3jv7f64tkgl40ts0",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 19, 2010 at 3:20 pm",
            "Content": "Your list has a conspicuous absence of **Katanagatari**. 12 episodes at 40 minutes each, that aired once a month for all of 2010. Characters are endearing, although the plot becomes a giant ass pull in the last two episodes, and the visual style is delightfully unique. Gene said he was trying to add them all to the drive when I asked him, but was complaining about how long the big files were taking to DL (they are around 800+ MB each, to be fair). Serious recommendation for everyone to give it a look.\n\nI think I’m going to watch Disappearance again in glorious 1080p because not seeing Haruhi’s drool (which Gene promised would be on the Blu Ray) absolutely ruined the movie for me.\n\nWinter 2011 is the season of OVA’s. A couple shows look interesting (Fractale, Infinite ~~Harem~~ Stratos, Todoke 2 because for some reason I liked the first and already turned in my Man Card for doing so), but I can’t wait for Tethe’alla 4 and Angel Beats Extra. Plus, Break Blade 3 and 4 in Jan and Feb. Whee.",
            "Replies": [
                {
                    "ID": "c2fm3jv7f64tkgl40tsg",
                    "ParentID": "c2fm3jv7f64tkgl40ts0",
                    "Author": "Gene",
                    "ReplyTo": "Jack",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 19, 2010 at 4:33 pm",
                    "Content": "Oh yeah, Katanagatari was good. I liked the parts with all the words. WHICH WAS ALL OF THEM. I have all the eps on the drive now.\n\n…and you best not be dissin’ my infinite harem stratos dawg. ONLY WOMEN CAN OPERATE THEM!!!\n\nFor reference, I found [this chart](http://neregate.com/blog/wp-content/uploads/2010/09/neregate.com-Winter-2011-Animes-v3.jpg) to be the most complete and informational. There are a lot of them out there. [This chart](http://img580.imageshack.us/img580/8232/winterv3.jpg) was easy to read and seems to cover all the important bits as well.\n\nDON’T FORGET THE ONII-CHAN ANIME. OH WAIT I’M ADOPTED.",
                    "Replies": [
                        {
                            "ID": "c2fm3jv7f64tkgl40tt0",
                            "ParentID": "c2fm3jv7f64tkgl40tsg",
                            "Author": "Chris",
                            "ReplyTo": "Gene",
                            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "December 19, 2010 at 4:51 pm",
                            "Content": "Yeah, I knew the chart was a bit outdated, but I was too lazy to find the most up-to-date one. Thanks for the link, updated.\n\nI’ve heard quite a bit about Katanagatari here and there, but never really got solid feedback as to its quality, so I didn’t mention it. I’ll probably watch it while hibernating through Winter 2011."
                        },
                        {
                            "ID": "c2fm3jv7f64tkgl40ttg",
                            "ParentID": "c2fm3jv7f64tkgl40tsg",
                            "Author": "steve",
                            "ReplyTo": "Gene",
                            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "December 19, 2010 at 5:18 pm",
                            "Content": "“OH WAIT I’M ADOPTED” = new standard setting for all incestuous vn, manga, and anime.\n\nOh wait… it’s like that now (less YnS lol).\n\nOH GOD THE SKY IS FALLING!!!!!!!!!!!!!!!!!!!!!!",
                            "Replies": [
                                {
                                    "ID": "c2fm3jv7f64tkgl40tu0",
                                    "ParentID": "c2fm3jv7f64tkgl40ttg",
                                    "Author": "Gene",
                                    "ReplyTo": "steve",
                                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                    "Date": "December 19, 2010 at 5:19 pm",
                                    "Content": "Hahahaha +1 Steve\n\nOH WAIT ALL THAT INCEST WASN’T REAL AT ALL!"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm3jv7f64tkgl40tug",
            "Author": "Manga Therapy",
            "Image": "http://1.gravatar.com/avatar/19c8a08e3a4a73e0ff00cabd7a5a1619?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 5, 2011 at 2:11 pm",
            "Content": "The bill is just another case of mishandling the issue of responsibility. I didn’t know that Japan can’t trust parents, just like everyone else.\n\nI posted some thoughts on what the law says about people in general. You can read it at: [http://www.mangatherapy.com/post/2609971604/youth-ordinance-bill](http://www.mangatherapy.com/post/2609971604/youth-ordinance-bill)\n\nWith the manga publishers fighting this law like crazy, we might experience a huge shift in how Japan progresses in the future.",
            "Replies": [
                {
                    "ID": "c2fm3jv7f64tkgl40tv0",
                    "ParentID": "c2fm3jv7f64tkgl40tug",
                    "Author": "Gene",
                    "ReplyTo": "Manga Therapy",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 5, 2011 at 7:23 pm",
                    "Content": "They’re fighting it like crazy, are they? I have yet to see any of them actually fighting it. I hear they’re bending over and taking it though."
                }
            ]
        }
    ]
}