{
    "Replies": [
        {
            "ID": "c2fm24f7f64tkgl40oo0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 10, 2012 at 12:34 am",
            "Content": "Shining Hearts was a pretty boring anime. I mean, maybe it was a decent game (an RPG with emphasis on item crafting and character relations, I could get behind that) but it really didn’t need the anime. Games are fun because you play them. Animated, they just turn into shounen-SoL hybrids, which is just the worst of both worlds. I think the time and budget could have been put to better use.\n\nLupin III was badass. I never saw the original series, so I can’t say much for it, but the spin-off looked pretty damn classy, and was reminiscent of Cowboy Bebop (which is my favorite anime of all time). The animation and soundtrack were great, and the story is never afraid to dabble with mature themes. It also doesn’t get full of itself and wallow in tragedy and drama, which makes everything more believable. And finally, all of the characters are interesting, which is always the first thing I look for in anime. If I had more time, I would be all over this show, but as it is, I’ll probably have to put it off until winter break.\n\nEh…Saki. I have a strange, complicated relationship with this show. Objectively, it’s mediocre in literally every single aspect. The characters are shallow, the plot is skeleton, the pacing is erratic, the animation is just adequate, the voice acting is unremarkable, and the soundtrack is forgettable. Somehow, by some alien magic I don’t comprehend, I still find it incredibly entertaining. Maybe superpower mahjong is just fun to watch, I don’t know. But I found the original series unusually enjoyable, and I probably know more about the Sakiverse than about most shows I actually purportedly liked. That said, I found Achiga-hen pretty…unnecessary. I’m assuming the point of it is to show us the underdogs, the team of tryhards that make it through practice rather than lesbianism, but in doing so, it loses all of what made the original series fun to watch. Regular mahjong is _boring_. And because there’s not much to show, most of the matches go by as a series of montages, leaving them highly unsatisfying. Without high-octane lightning-throwing tidal-wave-inducing mahjon to support them, the Achiga cast is pretty dull and forgettable, even as the main cast. Even in the last few episodes, where the mahjong is actually fun to watch, the spotlight falls entirely on another character altogether – Onjouji Toki, from Senriyama High, who duos the final boss while Kuro of Achiga sits and cries. Literally. Toki was a great character, but she’s not on team Achiga. It’s obvious that the whole point of Saki is superpowered lesbian mahjong, and by taking that away, Achiga-hen was a pretty disappointing experience overall. Looks like I’m back to waiting for Season 2, which will probably come out in like 2020 or something. Great."
        }
    ]
}