{
    "Replies": [
        {
            "ID": "c2fm2bv7f64tkgl40pj0",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 2, 2012 at 9:13 pm",
            "Content": "So, you “want Alice’s room, minus the teddy bears”?\n\nI want Alice’s room, with the teddy bears. And maybe plus Alice.\n\nNo, seriously. I’d love to have all the teddy bears."
        },
        {
            "ID": "c2fm2bv7f64tkgl40pjg",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 3, 2012 at 2:50 pm",
            "Content": "\\\u003eglaze over walls of text\n\n\\\u003eno Fate/Zero\n\nYou’ll need to explain this one to me. I’m reading through them still. It’s a completed season from the past year, and goddammit I’m putting it on my list.",
            "Replies": [
                {
                    "ID": "c2fm2bv7f64tkgl40pk0",
                    "ParentID": "c2fm2bv7f64tkgl40pjg",
                    "Author": "Chris",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 3, 2012 at 3:04 pm",
                    "Content": "I’m not going to consider Fate/Zero completed until the second part airs in the spring. From the way they’ve split it up, it feels like one big package, so it doesn’t feel fair to judge it yet. That, and I don’t really like putting sequels/second seasons on these lists. If you must know, Fate/Zero as it is would probably have ranked around #6-7. That said, it’s my personal decision, so I won’t judge anyone else if they put it on theirs.",
                    "Replies": [
                        {
                            "ID": "c2fm2bv7f64tkgl40pkg",
                            "ParentID": "c2fm2bv7f64tkgl40pk0",
                            "Author": "Gene",
                            "ReplyTo": "Chris",
                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 3, 2012 at 3:15 pm",
                            "Content": "Okey doke, after I wrote that comment I immediately reasoned that it makes sense not to put it on this list when it’s not technically “finished.” Besides, I expect quality from a Chris list, and seeing it on two lists for two consecutive years is redundant and bordering on fanwank. Leave the fanwank to me.\n\nAnyway, excellent list. A++++++++ would read again. In fact, I’m going to read it again because the Madoka one alone made my head hurt from the DEEP.\n\nDat Level E though, man. I’ve literally seen only three episodes of that (what we showed at anime club, lol) and now you make me REALLY want to see all of it before I put my list together, because I know that after I throw my list up, then watch it, I’m going to immediately regret not doing so. Something about, “troll-tastic show” seems to be a stronger advert to my personal interests than anything else. I loved Umineko for similar reasons.\n\nLooking at the past season, this is going to happen a lot to both of us. I spent break watching Penguindrum. Chris, there was simply not enough time this semester for either of us to not just watch anime, but enjoy it like we did our freshman year.\n\nYes, I passed Thermo and Fluids. If only barely. THANK. GOD."
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm2bv7f64tkgl40pl0",
            "Author": "David",
            "Image": "http://0.gravatar.com/avatar/07ed1a7e6fce7801a83d328aaa0e76b1?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 18, 2012 at 6:01 pm",
            "Content": "Unrelated the this post, yet this seems to be the best January post to ask this in in.\n\nDoes anyone have a review/list of what we were showing last week (Jan 11)? I recognize Usagi Drop, but part of me is wondering when I can look up the others so I can figure out how/if Survival Strategy/The Adventures of Invisible Penguins with Cameras comes to an end.",
            "Replies": [
                {
                    "ID": "c2fm2bv7f64tkgl40plg",
                    "ParentID": "c2fm2bv7f64tkgl40pl0",
                    "Author": "Chris",
                    "ReplyTo": "David",
                    "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 19, 2012 at 1:51 am",
                    "Content": "Matt’s in charge of the reviews, but he’s working on them. Mawaru Penguindrum did end (it’s 2-cour), and I’m pretty sure Gene has it if you want it. A lot of people were praising it as Anime of the Year on the interwebz, so it couldn’t have been that bad. The other show was Un-Go, but I don’t remember anything significant about it."
                },
                {
                    "ID": "c2fm2bv7f64tkgl40pm0",
                    "ParentID": "c2fm2bv7f64tkgl40pl0",
                    "Author": "Gene",
                    "ReplyTo": "David",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 20, 2012 at 3:15 pm",
                    "Content": "I’ve got Penguindrum. Part of it is in 1080p, they’re still releasing volumes of it. I’ll have it for you next week."
                }
            ]
        }
    ]
}