{
    "Replies": [
        {
            "ID": "c2fm26v7f64tkgl40p80",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 10, 2011 at 12:45 pm",
            "Content": "I thought Star Driver was a kids’ show that was trying really hard not to be a kids’ show. It was pretty cheesy and contrived and I thought it was rather bad. The plot also made pretty much no sense. To be fair, though, I did have to leave after the second episode, so maybe I’m missing something. Anyways, it’s not a show I need to watch more of, that’s for sure.\n\nDidn’t see Otome. ): Probably won’t bother to see it on my own, either, unless someone starts telling me how AWESOME it is.\n\nGosick was alright. I missed a little of the second episode, but from what I saw it seemed decent. I doubt I’ll watch more, but yeah, decent. You already pointed out most of its flaws; it’s not very interesting to watch the loli just whip out a metric ton of conjecture and turn out to be right about everything (that’s only fun in Phoenix Wright).\n\nIn other news, I CAN’T WAIT until second Eden of the East movie. I’ve really enjoyed the series so far, so I’m looking forward to more while hoping it doesn’t start to suck. Also looking forward to OreImo, since I’ve put off watching it since it’s the featured anime. Should be good stuff next week."
        },
        {
            "ID": "c2fm26v7f64tkgl40p8g",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 10, 2011 at 7:49 pm",
            "Content": "AAAA SHE’S ROLLING ON THE GROUND\n\nGod, galactic pretty boy, not sure if I want either. Good review, thanks for covering this week."
        },
        {
            "ID": "c2fm26v7f64tkgl40p90",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 13, 2011 at 4:00 pm",
            "Content": "Stardriver:\n\nAt first I was like o.O?\n\nThen “GINGA BISHOUNEN”\n\nThen I was like =(\n\nOtome didn’t really hold my interest, or maybe I just wasn’t paying attention; probably the latter.\n\nGosick is a show I’m following right now. Mystery is one of my favorite genres of stories, and this one is… meh… The deductive reasoning is kinda fun. I don’t really feel like anything TOO far from what is presented is deduced, but some of it is a stretch. The first arc I thought was pretty cool, just because of the supernatural element thrown in with historical fiction and fact. I won’t say anything about future arcs in case others would like to be surprised, since this is a mystery show.\n\nI’m excited to rewatch 「俺の妹がこんあに可愛いわけがない」starting next week. It was definitely one of the best shows from last year."
        },
        {
            "ID": "c2fm26v7f64tkgl40p9g",
            "Author": "Matthew Strand",
            "Image": "http://1.gravatar.com/avatar/91f41592590fd4634f415235b340d622?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 14, 2011 at 4:30 pm",
            "Content": "I missed Otome for an exam, and my sisters will enjoy Gossick. I think I’ll keep Star Driver in mind as an example of what good anime isn’t.",
            "Replies": [
                {
                    "ID": "c2fm26v7f64tkgl40pa0",
                    "ParentID": "c2fm26v7f64tkgl40p9g",
                    "Author": "Gene",
                    "ReplyTo": "Matthew Strand",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "February 14, 2011 at 6:29 pm",
                    "Content": "Remind me to keep following those. I have all of Otome actually, but I’ve been lazing on Gosick."
                }
            ]
        }
    ]
}