{
    "Replies": [
        {
            "ID": "c2fm26v7f64tkgl40p60",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 27, 2011 at 3:28 pm",
            "Content": "There are definitely no men in that picture, alright.\n\nMaybe I should introduce myself too, real fast? I’m Chris Lee, a junior in Mechanical Engineering. Some of you may recognize me as one of the Physics I TA’s. Mind you, I have zero professionalism during Anime Club meetings. I probably don’t need to describe myself further – if you stick around after meetings, you’ll learn plenty more about me than you ever wanted to know.\n\nNichijou was a show I was originally planning to watch as it aired, but…I don’t know. As I noted in a previous post, it didn’t really click with me. Some parts were genuinely funny, but many others just left me blinking and staring. I think it’s partially because unlike Lucky Star or AzuDaioh (which I enjoyed), the humor focuses less on the cast and more on their interaction with their surroundings. The jokes center on the cast’s ability to calmly accept completely outrageous happenings around them (and the title plays on that idea). So I guess I just don’t have the requisite sense of humor. I know most people enjoy this show, so I can hardly call it bad.\n\nLooking forward to whatever junk Gene shows next week.",
            "Replies": [
                {
                    "ID": "c2fm26v7f64tkgl40p6g",
                    "ParentID": "c2fm26v7f64tkgl40p60",
                    "Author": "Gene",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "August 27, 2011 at 5:44 pm",
                    "Content": "This week: Junk.\n\nNext week: More junk.\n\nI love how that works. The week after that is a surprise. Here’s a hint: It’s junk.\n\nBut seriously, I love Nichijou. I just wish it didn’t wear out it’s welcome."
                }
            ]
        },
        {
            "ID": "c2fm26v7f64tkgl40p70",
            "Author": "Steve W",
            "Image": "http://1.gravatar.com/avatar/1f28be129fe5df07bdab24b2487abc22?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 29, 2011 at 7:18 pm",
            "Content": "I’ve watched half of Nichijou, and I’m not really planning on finishing it. IMO the only good episodes are the first three, and really only because of the rock-paper-scissors and jumprope sketches (which stop after the first three episodes). The button sketch was pretty good as well, but really there’s not much to this show.\n\nIf I remember correctly, next week will be alright, maybe I’ll do a preview or some shit."
        },
        {
            "ID": "c2fm26v7f64tkgl40p7g",
            "Author": "Matthew Strand",
            "Image": "http://1.gravatar.com/avatar/91f41592590fd4634f415235b340d622?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 31, 2011 at 5:16 pm",
            "Content": "The skits were fun, the rest was bland. I got bored and played with transistors instead. I don’t enjoy SoL anime in general, though, so no surprise there. I look forward to the rest of the semester’s showings."
        }
    ]
}