{
    "Replies": [
        {
            "ID": "c2fm3cv7f64tkgl40sk0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 3, 2011 at 4:23 pm",
            "Content": "It was a pretty impressive showing, I think that’s the most people we’ve had at a single showing all semester. Thanks to all those who decided to give anime club a shot, hope you all come back.",
            "Replies": [
                {
                    "ID": "c2fm3cv7f64tkgl40skg",
                    "ParentID": "c2fm3cv7f64tkgl40sk0",
                    "Author": "Grant Walker",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "March 3, 2011 at 6:22 pm",
                    "Content": "I’m trying to convince Robbie and Chris to return… I don’t think it’ll happen, but I’m trying.\n\nWE NEED MORE CASUALS TO CONVERT."
                }
            ]
        },
        {
            "ID": "c2fm3cv7f64tkgl40sl0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 3, 2011 at 5:46 pm",
            "Content": "GIANT LAZERZ PEW PEW ROBOT PORN FLWRZ UNDRSTND1NG!! /end Gundam review (but really, it wasn’t bad)\n\nOreImo finally gets to the Ayase-Kirino showdown. And strangely enough, I think I’m in the minority when I say I’m not really that angry Ayase. A lot of people accuse her of not being understanding, being a bitch, and failing as a friend overall. I disagree with that notion – in fact, I think Ayase is actually a pretty good friend. To come that conclusion, we need to consider her perspective in all this. Just like Kirino’s dad, all Ayase knows of anime/eroge is from the news – it’s a bad influence, it makes killers and psychos out of people, and is generally a bad thing. _We_ know that’s not necessarily true, but keep that in mind.\n\nSeeing her friend get into that stuff, Ayase tries her damndest to get Kirino to drop it. She just doesn’t want to see Kirino go down a road she perceives as dangerous. She’s even willing to sacrifice her cherished friendship to save Kirino. Still sound dumb? Watch the interaction again (particularly the conversation at the playground), but replace “anime” with “drugs.” Suddenly, we have Kirino, the drug addict, rambling about how drugs define her life, and Ayase, the desperate friend trying to save her. If you knew your friend was starting to do crack, or heroin, or meth, wouldn’t you try to save him? Yell at him, beg him, stake your friendship on it? Isn’t that what friends do? I mean, sure, _we_ know that anime and crack are hardly comparable, but again, consider Ayase’s perspective and knowledge. Ayase’s not guilty of being a bad friend – she’s just guilty of being too shallow-minded to understand anime isn’t all that bad.\n\n/end rant 2\n\nToo bad for friendzone-chan. Oh well, leaves Kyousuke open for Kuroneko. And I don’t Kirino’s a really bad character (in the grand scheme of things), just vastly inferior to every other female in the show, IMO. Although ultimately, nothing matters, because Kuroneko is the best character, and this is fact. I’m sad I’m going to have to miss next showing (Dynamics midterm), because I love what happens in the next couple episodes. Kuroneko FTW.",
            "Replies": [
                {
                    "ID": "c2fm3cv7f64tkgl40slg",
                    "ParentID": "c2fm3cv7f64tkgl40sl0",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "March 3, 2011 at 6:28 pm",
                    "Content": "YEAH MAN GIANT ROBOTS FIRIN THEIR LAZAHS lol gundam\n\nI guess when you put it that way, yeah, Ayase isn’t a bad friend or anything. But just because her ignorance is understandable doesn’t really make it less annoying. At least, not for me. Not saying she’s a bad person or anything, but man, she needs educating. I wouldn’t be surprised if she lightens up by the end, though. Not that I actually know…\n\nGlad to hear good stuff is coming, though! Awaiting next week’s showing. Also, would cosplaying Kuroneko be like… meta-cosplaying? Since, I mean… yeah. /stupid"
                }
            ]
        },
        {
            "ID": "c2fm3cv7f64tkgl40sm0",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "March 4, 2011 at 10:44 am",
            "Content": "One of the reasons I like mecha is:\n\nMOAR\n\nFUCKING\n\nLAZORZZZZZZZ\n\nPEWPEWPEWPEWPEWPEWPEWPEWPEWPEWPEWPEWPEWPEW\n\nso it was nice to see excessive and ridiculous weapons in my mecha.\n\nI missed OreImo this week because of a Lockheed Martin info session, but that’s k, I watched it while it was airing this past fall. I fucking love childhood friend’s grandparents. They’re on par with Nagisa from Clannad’s parents and the parents in KissxSis.\n\n“I have a heart condition from the war… if you don’t sleep with my granddaughter I’ll die.”\n\n“Obasan, Kyosuke wants to take a bath with me.” “… then do it.”\n\nGreatest. Grandparents. Ever.",
            "Replies": [
                {
                    "ID": "c2fm3cv7f64tkgl40smg",
                    "ParentID": "c2fm3cv7f64tkgl40sm0",
                    "Author": "steve",
                    "ReplyTo": "steve",
                    "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "March 4, 2011 at 10:49 am",
                    "Content": "also,\n\nWHY ISN’T IT THURSDAY YET?",
                    "Replies": [
                        {
                            "ID": "c2fm3cv7f64tkgl40sn0",
                            "ParentID": "c2fm3cv7f64tkgl40smg",
                            "Author": "Gene",
                            "ReplyTo": "steve",
                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "March 4, 2011 at 1:39 pm",
                            "Content": "WHAT? IS IT THURSDAY YET?",
                            "Replies": [
                                {
                                    "ID": "c2fm3cv7f64tkgl40sng",
                                    "ParentID": "c2fm3cv7f64tkgl40sn0",
                                    "Author": "Grant Walker",
                                    "ReplyTo": "Gene",
                                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                    "Date": "March 4, 2011 at 4:29 pm",
                                    "Content": "Did somebody say Thursday?"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}