{
    "Replies": [
        {
            "ID": "c2fm3677f64tkgl40rp0",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 10, 2011 at 2:33 pm",
            "Content": "I have just few things to say. For now.\n\nWhen you said that Zero is trying to hard to tie in the characters from Night, let me just say that Night DOES mention Saber and Gilgamesh participating in the 4th war. You can’t really do anything about that if the original creator of the franchise had already set the Saber and Archer class for the 4th war.\n\nNight also mentions that Kiritsugu and Saber only spoke 3 times during the 4th war, and Urobuchi tried to follow that and made the 3 “conversations” the times when Kiritsugu used the 3 Command Spells, and I think it’s pretty cool to try not to break any canon.\n\nAnd the characters do change. Saber was more naive in Zero. For example, answered “yes” to 4th Lancer’s question, “are you the Saber class?” but in the 5th war, she answered “maybe” to 5th Lancer’s question, “is your weapon a sword?” And her Luck rank changed to B from D. But it’s mostly because it’s Urobuchi writing Zero, who is known to have the Noble Phantasm called “The Traps of Hell and Heaven (Dead End Catharsis)” (you know Noble Phantasms have names like that, right?), where the characters in his work have their Luck rank decrease.\n\nAlso, Waver Velvet makes appearance in Night, as Lord El-Melloi II. (Though the official concept art book says “Load” El-Melloi II, I’m sure it’s just Type-Moon being Japanese.) And he is pretty awesome guy, according to what I found, unlike Waver in Zero. See? The characters are not that static."
        },
        {
            "ID": "c2fm3677f64tkgl40rpg",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 10, 2011 at 5:04 pm",
            "Content": "\\\u003e\\\u003ebest anime of spring\n\n\\\u003e\\\u003e Madoka Magica\n\nNot sure if trolling, since PMMM _did_ technically leak into the spring season.\n\nThe premise of Haganai is nothing new. It’s harem. It somewhat differentiates itself by making otaku culture a significant part of the show, like OreImo, but all the standard character archetypes are there. The childhood friend, the princess, the reverse-reverse trap (a girl that pretends she’s a guy that looks like a girl), the genius girl, the loli, and the imouto. No, what makes this show worth watching for me is entirely in its references. I missed out a bit on the last reference-heavy show I remember watching at anime club (Seitokai no Ichizon) because I didn’t have much of a repertoire to draw from then, but I’m getting most of these. Call me shallow, but I gotta find enjoyment where I can in this desert.\n\nFate/Zero is basically what I expected it to be. Awesome fighting and animation and music and crazy plans. I do kinda agree that the weekly episode format seems to break the pacing quite a bit, though. I don’t expect to get any real emotional investment in the characters, but that’s ok.\n\nBen-to has, as you say, a ridiculously idiotic premise. But it seems to be riding that line of just-serious-enough that it’s not silly, and not-serious-enough that it’s not pretentious. It’s an average story with an amusing delivery. Or an average bento with an interesting package…or something.\n\nOh, and in case you all haven’t heard, I have a wedding to attend every day this week including Saturday, so meeting at my place might be delayed an hour or so (because you guys are always on time anyway). I’ll let you guys know when it happens."
        }
    ]
}