{
    "Replies": [
        {
            "ID": "c2fm3qf7f64tkgl40uhg",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 12, 2011 at 2:05 pm",
            "Content": "You may have noticed that I didn’t actually skip number 9. This is because I am an idiot who didn’t bother to proofread his own titles."
        },
        {
            "ID": "c2fm3qf7f64tkgl40ui0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 12, 2011 at 2:50 pm",
            "Content": "Iron Man was the most hilariously bad attempt at a Japanese studio attempting an American comic book character I’ve seen, but we might have another winner with Wolverine. We’ll see. I watched past ep 1 of iron man and deeply regretted it. Remember, when you’re anime club president, you better watch EVERYthing. Otherwise, you’re just not doing your job.\n\nMegane na kanojo was good. Glasses girls are hawwwwwwt~. Jack, do me a favor and never sing that song at meeting. Singing it to myself in my room was enough.\n\nKaichou’s spot is well deserved. For being another classical shoujo, it did a hell of a job. I think it helped that I had low standards going in (see: J.C. Staff’s previous shoujo, “Special A” which was far more rageworthy).\n\nKuragehime’s OP is the only thing I really remember, because it was 10^awesome, but I wouldn’t relate it to Ore Imo insofar as both having otaku girls. Kuragehime was a lot of fujoshi pandering, with the overall message that “being into that stuff is ok” plot has literally nothing to do with the theme in Ore Imo which I can only describe as “being an anime fan really sucks sometimes.”\n\nI mean, seriously, “It shows off the misunderstanding/distrust directed at otaku in Japan today, in a reasonably believable fashion; there’s just not enough of it.” Are you blind? It had otaku satire out the butthole! You even mention the Meruru being for man-dudes rather than for little girls as it first appears, but don’t notice the thousands upon thousands of nods of Japanese otaku culture in each ep. I personally put it so high on my list _because_ of the sheer amount of satire. I don’t expect to change your opinion regarding the show this semester when I feed every single episode down your throat a second time, but hopefully you’ll hear me out when I delve into why the show did what it did. God, Kuragehime was such fan-pandering, you’re better off comparing it to PSG. We’ll be watching jelly queen this semester.\n\nIdk what ur talkin’ bout Jack, I saw drool on the BD. Wait, that’s my drool. Lemme clean that…\n\nKatanagatari was like watching a book, but it was at least a decent book with really pretty art. It just suffers from bad pacing, in my opinion. If only for the literary merit, I liked the ending, but otherwise, yeah, monitor-punching level of rage.\n\nYour PSG argument holds very little water only because its far easier to argue the opposite. PSG had the sex jokes, overemphasized sex scenes, and over-the-top fights to directly appeal to a well-defined fanbase. It gets props only for not trying to pretend otherwise. The fact that all the above was built up to the last episode where the dam broke supports the contrary. It’s not like panty and stocking realized at the end what disgusting sinners they were and sought reconciliation. Rather, the message was that they were girls and they’ll “do what they want because f\\*\\*k it.” I’d buy that argument for the three-part chuck episode, which was a nice satire of DEEP, but most of the time it was basically directors experimenting on the PSG operating table. Still excited for the second season? I doubt they would’ve planned on it if they were giving otaku fans the middle finger for liking it.\n\nI deeply regret showing the camrip of Disappearance, if only because I feel it may have caused you to throw it so low on the list. I don’t regret getting all of Tatami on the hard drive, I’m glad you liked it.",
            "Replies": [
                {
                    "ID": "c2fm3qf7f64tkgl40uig",
                    "ParentID": "c2fm3qf7f64tkgl40ui0",
                    "Author": "Gene",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 12, 2011 at 2:58 pm",
                    "Content": "By the way, that middle finger to the otaku fanbase didn’t come from PSG, it was in OreImo. Just thought I’d point that out.",
                    "Replies": [
                        {
                            "ID": "c2fm3qf7f64tkgl40uj0",
                            "ParentID": "c2fm3qf7f64tkgl40uig",
                            "Author": "Jack",
                            "ReplyTo": "Gene",
                            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 12, 2011 at 4:42 pm",
                            "Content": "Yeah, the PSG thing is a terrible theory. Looking back on what I wrote, I played it up as “interesting” when I think I should have instead called it more “funny” that Gainax would try for another highbrow deconstruction by putting together the most racy, offensive, lowbrow show imaginable. The show was ridiculous, don’t-think-about-it-too-hard FUN, and trying to imagine that as some sort of DEEP criticism of something makes me chuckle every time I think of it. Sorry about my DERP moment in expressing that.\n\nHaving had time to let my haterade for Kirino/Kyousuke simmer down a bit, I’ll be giving OreImo a second chance at the showings. Having already complained enough about how I didn’t enjoy it much, maybe I’ll be able to better see what I was complaining about missing in the list. I really would like to be able to bump it above Kuragehime. Come to think of it, if I could manage that, Kuragehime would likely fall to #10 or off the list entirely; it’s mostly where it is at this point as a contrast point to OreImo. (Although I did honestly enjoy it)\n\nI’m not sure skipping the camrip would have made me put Disappearance much higher. It _might_ have slipped past Angel Beats, but I’m doubtful I would have liked it better than Katanagatari. I can’t say much except to repeat myself that it’s just _more Haruhi_, for better and worse."
                        }
                    ]
                },
                {
                    "ID": "c2fm3qf7f64tkgl40ujg",
                    "ParentID": "c2fm3qf7f64tkgl40ui0",
                    "Author": "steve",
                    "ReplyTo": "Gene",
                    "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 12, 2011 at 10:33 pm",
                    "Content": "For some reason… people either really like OreImo, or really hate it. Appearantly we’re in the minority, Gene xp. Also obligatory, no Shiki again? De feck?\n\nI don’t think PSG deserves to be on anybodys’ top 10 list outside of honorable mention. There were 3 good episodes (1, 6 (Scanty and Kneesocks), and 13) and the end of 13 made me rage so hard that I almost broke my computer (by the way, season 2′s official title is Panty vs. Stocking). GAINAX BE TROLLING YO.\n\nI’m glad somebody else liked Katanagatari. Historical fiction is definitely one of my favorite genres. The ninjas were definitely a highlight. Every time a new one was introduced all I could think was, “wut…”\n\nI watched the first episode of Ironman raw, just because I could. It should be noted, that was the only episode of Ironman I watched. The raw was enough for me to decide that the premise of the show was not “Tony Stark goes to Japan to expand his business and bring notoriety to Ironman,” but rather “Robert Downey Jr. goes to Japan.” Shows that are this bad make you wonder why Madhouse ever signed an agreement with Marvel to bring American superheroes to anime; AND THEY DID IT FOR 4 SERIES. That’s right, there’s two more on the way. =(\n\nI’m excited to rewatch OreImo at the showings. Definitely one of the better shows from this past year.\n\nOh, also, since the winter season sucks so much ass (minus Madoka ofc), the spring chart is already out. [http://thecartdriver.com/charts/spring-2011-v1-2/](http://thecartdriver.com/charts/spring-2011-v1-2/) Still incomplete, but this is what’s been announced so far. Maybe I’ll get Gene to let me make a post about what to watch, or I’ll just wait till he does and then take up a foot of the webpage in the comments lol.",
                    "Replies": [
                        {
                            "ID": "c2fm3qf7f64tkgl40uk0",
                            "ParentID": "c2fm3qf7f64tkgl40ujg",
                            "Author": "steve",
                            "ReplyTo": "steve",
                            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 12, 2011 at 10:40 pm",
                            "Content": "Addendum:\n\nLol at Lotte’s Toy."
                        },
                        {
                            "ID": "c2fm3qf7f64tkgl40ukg",
                            "ParentID": "c2fm3qf7f64tkgl40ujg",
                            "Author": "Jack",
                            "ReplyTo": "steve",
                            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 12, 2011 at 10:57 pm",
                            "Content": "Shiki’s not on my list because I haven’t actually watched it yet. 😛\n\nI was waiting for it to finish so I could just marathon the whole thing. Which I will do as soon as a batch torrent goes up or I go grab it off the drive (assuming it’s one there).",
                            "Replies": [
                                {
                                    "ID": "c2fm3qf7f64tkgl40ul0",
                                    "ParentID": "c2fm3qf7f64tkgl40ukg",
                                    "Author": "steve",
                                    "ReplyTo": "Jack",
                                    "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                    "Date": "January 12, 2011 at 11:30 pm",
                                    "Content": "If Gene doesn’t have it (pretty sure he does), I do. Unfortunately, there’s not a batch, I just checked. umee.is-fabulo.us"
                                }
                            ]
                        },
                        {
                            "ID": "c2fm3qf7f64tkgl40ulg",
                            "ParentID": "c2fm3qf7f64tkgl40ujg",
                            "Author": "Gene",
                            "ReplyTo": "steve",
                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 13, 2011 at 7:46 am",
                            "Content": "Yeah, this season makes me kind of sad. I’ll be making a post on spring and this season and all those little things that frustrate me.\n\nShiki’s on the drive, all 22 eps. I have a feeling there’ll be one more with the bluray."
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm3qf7f64tkgl40um0",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 13, 2011 at 8:07 pm",
            "Content": "Another interesting list, even though I haven’t actually watched more than half of the things on it. It was a nice read, at least. Always good to see Tatami Galaxy on top, too!\n\nI don’t really have any clever or intelligent things to contribute, but Break Blade’s placement does baffle me, since I didn’t think it was _that_ good looking. If anything, I thought the cumbersome robots made battle look kind of clunky and boring (I mean, clunky can be interesting, but I didn’t find Break Blade to be, I guess).\n\nStill, it’s not like I can exactly contest the list since, like I said, haven’t seen most of the things–kind of neat to see some stuff that wasn’t on any previous lists, though.\n\nI’d hunt myself a cookie, but I skipped the Katanagatari section almost entirely, since that’s one of the shows I do plan to watch later."
        }
    ]
}