{
    "Replies": [
        {
            "ID": "c2fm39n7f64tkgl40sag",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 27, 2011 at 3:20 pm",
            "Content": "Perhaps a better name would be “Slow Anime Night,” since the shows were on the whole not entirely terrible (as you point out), despite being outpaced by molasses.\n\nI didn’t pay much attention to Yakumo (I lost Gene’s no-laptop challenge before the showing even started), so all I can comment on is that it had some sort of weird shading/outline effect that was mildly jarring and that the little girl was at once both DERP-inducing and rather adorable. Perhaps it was a horrible show. Making me bored enough to pull out my laptop before the first eyecatch is probably a bad sign.\n\nI liked Katanagatari before, still like it now. Wearing my best trollface while listening to everyone bemoan the nigh-DBZ levels of talk-talk-talk-talk-short fight was a very enjoyable way to rewatch the first two episodes. It picks up later, but the amount of talking never really decreases (how else do you fill 40 minutes of animation?), so it’s good that you can tolerate it lest you rip your hair out in frustration in later episodes.\n\nBakuman — eh. I can see the appeal of the plot and the humor being put out, but something just didn’t click for me. The hair on that girl’s mom, though; sheesh. O.o\n\nLooking forward to seeing everyone shit bricks when we show Madoka next meeting (or whenever if plans change or I misunderstood). [Kyubey] _Hey, CSM anime club, don’t you want to be trolled by SHAFT?_ [/Kyubey]",
            "Replies": [
                {
                    "ID": "c2fm39n7f64tkgl40sb0",
                    "ParentID": "c2fm39n7f64tkgl40sag",
                    "Author": "Grant Walker",
                    "ReplyTo": "Jack",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 28, 2011 at 10:44 am",
                    "Content": "I love DERPgirl, but yeah, definitely not enough to keep me watching a show or anything.. If half the show was her mute smile and awkward head tilts, then maybe.\n\nI think I liked Katanagatari, too. Only three episodes were on the drive I inspected, so I’ll have to grab the remaining nine myself, but I really like the art style and I find the characters pretty charming. The fact that the original author of the light novels also wrote Bakemonogatari also tickles me (and makes sense, I guess, considering the titles). I’m hoping it’ll be enough for me to forgive the rather formulaic shounen set-up it has."
                }
            ]
        },
        {
            "ID": "c2fm39n7f64tkgl40sbg",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 27, 2011 at 4:53 pm",
            "Content": "Adjusted the schedule, warned Daniel, and called the cops. We’re showing Madoka next week. Hey guys, won’t you watch anime with me next week?\n\nYakumo isn’t very good. Katanagatari shouldn’t even be fitted with the likes of it. I agree with the sentiment, PDY is the first bad show we’ve shown this semester, and really it only stayed on the list because Matt Armijo called it “Psychic Detective Bakuman” when we were making the list a while back. He also said we were reaching into abscesses as opposed to recesses looking for anime to show this semester. That still makes me chuckle, even though he’s right!\n\nI think I made it pretty clear during the showing, Bakuman pales compared to the comic book (hurrrrr). Then again, we’re an anime club, we show anime. Japanese culture plays a major role, sure, but manga is outside our scope. As an animated medium, I felt like Bakuman slowed down and never kept momentum through the series, so I guess that’s just the “feels bad man” aspect of watching the show.\n\nOn a related note, that really makes the whole idea of an “anime convention” a bit of a misnomer, don’t you think? I mean, anime’s usually a pretty big part of it, but most of the time it seems like people just go to those because its like a small Japan. A small Japan filled with otakus instead of working fathers that drink all the time.",
            "Replies": [
                {
                    "ID": "c2fm39n7f64tkgl40sc0",
                    "ParentID": "c2fm39n7f64tkgl40sbg",
                    "Author": "Grant Walker",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 28, 2011 at 10:49 am",
                    "Content": "I feel like I’m the only guy around who hasn’t seen Madoka yet. I keep hearing about how startling the third episode is, so I hope I’m not building it up too much in my mind as to be disappointed.\n\nI might actually check out the Bakuman manga if it really is that much better. I’ve been reluctant about reading manga lately, though–I hate reading it on a computer screen, yet I don’t want to pay $11 for a book I can finish in ten minutes. I guess we’ll see.\n\nAnd I guess that’s true about the anime convention… like a little Japan with less Asians and probably more pasty white cosplayers like me."
                }
            ]
        },
        {
            "ID": "c2fm39n7f64tkgl40scg",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 27, 2011 at 10:23 pm",
            "Content": "Yakumo was legitimately bad. It was boring, cliche, and lacked direction and thought. That’s all I have to say about it.\n\nKatanagatari had a very cool animation style, and a looooooot of talking. The characters are pretty interesting (even if the plot is rather unoriginal). I just wish they’d either talk less, or talk about more interesting things. I’m usually okay with excessive amounts of talking (I did like Tatami Galaxy and Bakemonogatari), but this was even getting to me at points.\n\nBakuman, also, wasn’t too bad. I don’t know I’d be enthralled with a show about aspiring mangaka, but it could have been much worse. I’ll just take Gene’s word for it that the source material is superior, never really check it out, and call it good.\n\nMADOKA NEXT WEEK",
            "Replies": [
                {
                    "ID": "c2fm39n7f64tkgl40sd0",
                    "ParentID": "c2fm39n7f64tkgl40scg",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 28, 2011 at 10:57 am",
                    "Content": "/agree and stuff\n\nCan’t wait to see the brickshitting everyone’s talking about next week…\n\nOn an unrelated note, I blame you and Gene for getting me addicted to Kumikyoku. I usually don’t listen to a single song repeatedly like this, but jeez. I guess I’m… slightly justified in that it’s not just one song.",
                    "Replies": [
                        {
                            "ID": "c2fm39n7f64tkgl40sdg",
                            "ParentID": "c2fm39n7f64tkgl40sd0",
                            "Author": "Chris",
                            "ReplyTo": "Grant Walker",
                            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 28, 2011 at 6:05 pm",
                            "Content": "You know it’s not the only Kumikyoku, right?\n\n[http://kumikyoku.rintaun.net/](http://kumikyoku.rintaun.net/)\n\ntrollface.jpg",
                            "Replies": [
                                {
                                    "ID": "c2fm39n7f64tkgl40se0",
                                    "ParentID": "c2fm39n7f64tkgl40sdg",
                                    "Author": "Grant Walker",
                                    "ReplyTo": "Chris",
                                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                    "Date": "January 28, 2011 at 9:13 pm",
                                    "Content": "I ended up figuring that out as I was searching for it, but… must not click…"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}