{
    "Replies": [
        {
            "ID": "c2fm2o77f64tkgl40qk0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 17, 2011 at 3:17 pm",
            "Content": "Glad you liked OreImo. It _is_ kind of a niche show, and probably not for everyone, but I enjoyed the satire in it. Kirino isn’t exactly my favorite character ever (I ranked her as Worst Little Sister of 2010, after all), but she does what she needs to do.\n\nI sadly never watched the first Eden of the East movie (though I watched the show), but I was still able to get most of the backstory. I think they made movies so they could take as long as they needed to to make them (aka lazy). But yeah, a 24-episode series would probably have done just fine. Movie 3 to come?\n\nNanoha next week. Good thing? I guess we’ll see."
        },
        {
            "ID": "c2fm2o77f64tkgl40qkg",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 17, 2011 at 3:25 pm",
            "Content": "Eden of the East must have been incredibly confusing for anyone who didn’t see any of the rest of the series. I imagine seeing the first movie (I know a couple of my friends only saw that) would keep the viewer from being completely lost. I’m kinda curious to hear back from someone who went into it “blind.”\n\nAs for seeing more of the series, I can’t say I’d complain. I think something like a series of prequel episodes detailing who the selecao were, how Saizo earned his fortune, how he managed to set up the Selecao network, etc would be really cool. Straight continuation of the plot would be nice as well, but I think most of the unexplored territory the series has left lies in the past rather than the future.\n\n\\\u003e\\\u003e _[the series] ended with a bang._\n\nGoddamnit Grant."
        },
        {
            "ID": "c2fm2o77f64tkgl40ql0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 17, 2011 at 7:57 pm",
            "Content": "So uh, I have an outdated list, the Gundam 00 movie is actually next week, as per the super-secret contract formed by the officers in your anime club. The covenant has spoken, Nanoha won’t be for another 2-3 weeks.\n\nHope you all don’t mind if I ramble about Ore Imo later, it’s definitely pretty niche."
        }
    ]
}