{
    "Replies": [
        {
            "ID": "c2fm39f7f64tkgl40s5g",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 20, 2011 at 12:35 am",
            "Content": "Don’t worry about the links, apparently we’re already using 60% of the server and I think tinypic’s going to be our friend from now on.\n\nI was a bigger fan of the “filler” shows between arcs in TWGOK. If there wasn’t so much exposition in the first couple of eps, we would’ve skipped right to those. It gets off to a good start, and the satire ball does get rolling. Episode 4 is by far my favorite, with the glitchy dating sim. Then I play favorites with arcs, even if they feel a bit too strung out.\n\nTrying to finish soredemo, I got most of the way in then sort of stopped. I’ve got work to do man, being anime club president is hard work! I did watch Kuragehime, if only because it got picked up by funimation. No comment there, but you can _stream_ the rest of it if you so desire.\n\nI sure do love video games. I’m glad I got to lose sleep over Amnesia again. God, pimpwalk’s a scary mofo. On a different note, everyone should try Daniel’s hard beat game. I’m the best at it, don’t let anyone (especially the creator thereof) tell you otherwise. Daniel, please continue to be awesome.",
            "Replies": [
                {
                    "ID": "c2fm39f7f64tkgl40s60",
                    "ParentID": "c2fm39f7f64tkgl40s5g",
                    "Author": "Grant Walker",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 20, 2011 at 9:51 am",
                    "Content": "I’m looking forward to more TWGOK, if only to see if it really does pick up. Not that I doubt you. I’m sure it won’t take too much effort for the show to draw me in, as I started to like it the more I watched.\n\nAs for Soredemo and Kuragehime, I dunno. I want to give Kuragehime a chance, and having Soredemo around for some light fun every now and then wouldn’t be too bad.\n\nI’ll never be proficient at that game you guys were playing. Failing Dango Daikazoku on easy would make me cry."
                },
                {
                    "ID": "c2fm39f7f64tkgl40s6g",
                    "ParentID": "c2fm39f7f64tkgl40s5g",
                    "Author": "steve",
                    "ReplyTo": "Gene",
                    "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 20, 2011 at 10:17 am",
                    "Content": "Will you look at my painting?\n\nFFFFFFFFFFFFFFFFFFFFUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU\n\nAnd I agree with you Gene; the arcs were enjoyable to watch, but Keima and Elsie’s episodes were the best. I really liked the structure for the series where there was an arc, then an Elsie episode, then another arc, then another Elsie episode, then another arc, then Keima going God-mode. TWGOK was definitely one of the better shows from the fall.\n\nalso, @Jack…\n\nFuck you talking about terrible… show of the season right there"
                },
                {
                    "ID": "c2fm39f7f64tkgl40s70",
                    "ParentID": "c2fm39f7f64tkgl40s5g",
                    "Author": "Daniel Pascua",
                    "ReplyTo": "Gene",
                    "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 20, 2011 at 9:02 pm",
                    "Content": "I’m still improving that game now. There’s some easier songs, and (since it seems to be too easy for some people…) a few harder ones too. 😉 When I finish up the standard game mode, I’m gonna do something that’s probably never been done with a rhythm game before! (Imagine simultaneously doing the rhythm game [which already has 3 screens] and a real time battle game…)",
                    "Replies": [
                        {
                            "ID": "c2fm39f7f64tkgl40s7g",
                            "ParentID": "c2fm39f7f64tkgl40s70",
                            "Author": "Gene",
                            "ReplyTo": "Daniel Pascua",
                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 20, 2011 at 10:38 pm",
                            "Content": "ITS LIKE MY DREAMS ARE COMING TRUE RIGHT BEFORE MY EYES"
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm39f7f64tkgl40s80",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 20, 2011 at 7:26 am",
            "Content": "\\\u003e\\\u003e _Hotori voiced by Hanazawa Kana_\n\n…? Your sarcasm’s not being laid on thick enough here, mate (was that sarcasm?). Looking back on my top 10 list to ensure I didn’t actually claim this, I also realize I managed to mix up Aoi Yuki (who voices Tatsuno) with Chiaki Omigawa (who voices Hotori and P-ko). Derp.\n\nGod Only Knows was a fun watch. If I ever run dry on anime, I’ll probably finish the rest of it (even though having more than a season’s worth of episodes usually makes me reticent to do so). Also, I am disappoint at richgirl’s kneesocks. She could have been a Grade S Zettai Ryouki if they had just added another 6-8 inches.\n\nKuragehime really banks on your liking (or at least tolerating) the setup you described. If you can’t/don’t like that (which is understandable), you probably won’t care for the rest. In case you care (spoilers) Tsukimi does _sort of_ wind up with Kuranosuke, if only because his brother gets involved in a blackmail affair with a bitchy redevelopment lady trying to earn their family’s political support after pretending to rape him. There’s a great scene with Kuranosuke pointing out to her that Shu’s a virgin and a picture of a flying unicorn popping into her head. However, the series ends before the relationship goes anywhere. Which was odd. (spoiler) Also, good point on the Game of Death/Kill Bill reference. I hadn’t remembered that, and was only reading off of tvtropes.\n\nOne more thing! For bad anime night, we should totally show Onii-chan no Koto nanka Zenzen Suki Janain Dakara ne!! Everyone will have a great time watching this truly awful anime. AMIRITE?",
            "Replies": [
                {
                    "ID": "c2fm39f7f64tkgl40s8g",
                    "ParentID": "c2fm39f7f64tkgl40s80",
                    "Author": "Gene",
                    "ReplyTo": "Jack",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 20, 2011 at 8:22 am",
                    "Content": "The funny thing is we somehow found worse anime than that."
                },
                {
                    "ID": "c2fm39f7f64tkgl40s90",
                    "ParentID": "c2fm39f7f64tkgl40s80",
                    "Author": "Grant Walker",
                    "ReplyTo": "Jack",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 20, 2011 at 10:04 am",
                    "Content": "…Wow. Pretty huge mistake on my part. Nope, that wasn’t sarcasm at all. I didn’t mean to imply you claimed Hanazawa was in Soredemo, but I guess I got confused, since Hanazawa played Tsukimi from Kuragehime, which is something you mentioned in your list. Somehow I definitely got things backwards.\n\nSo, yes: let it be known that Hotori was voiced by Chiaki Omigawa, not Hanazawa Kana. Don’t know what I was thinking there. MAH BAD GUYS.\n\nI do plan on giving Kuragehime a fair chance, so I will watch more. Parts of the concept I do like, and like I mentioned above, there were jokes and references that I thought were pretty clever. Could say kind of the same for TWGOK."
                }
            ]
        },
        {
            "ID": "c2fm39f7f64tkgl40s9g",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 20, 2011 at 5:56 pm",
            "Content": "I remember watching the first episode of SoreMachi a while with Gene, thought it was pretty good, liked the soundtrack, and promptly forgot about it. It’s clearly a easygoing slice-of-life show, and while that isn’t bad, I think I’m a bit burned out of those kinds of shows. It could be something I’d watch an episode of at a time in between episodes of other stuff coming out this season. Dunno. Might look into getting the rest of it at some point.\n\nTWGOK is something I sort of meant to watch last season after I heard it was pretty good, then forgot to. I’ll probably watch it over this season when I get a chance (nabbing it now). I think it’s a pretty funny show, especially because I do the exact same thing Keima does when I watch RomCom/harem anime (“Oh, this character is x-archetype; her arc will probably go something like this”). I don’t find the characters particularly interesting, as they’re pretty vanilla (though that’s arguably the point), but it’s not bad, and it’s short.\n\nAs for Kuragehime…I’ve got mixed feelings. It’s clearly trying to do something different from the rest of the shiny moe-centric anime around it, and that by itself somewhat intrigues me. On the other hand, I don’t know if the scenario is something I particularly enjoy. I might watch more down the road, but there’s other things I’d rather watch first.\n\nAnd while Onii-chan is definitely terrible, Gene’s right – there’s worse. Look forward to it.",
            "Replies": [
                {
                    "ID": "c2fm39f7f64tkgl40sa0",
                    "ParentID": "c2fm39f7f64tkgl40s9g",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 20, 2011 at 8:25 pm",
                    "Content": "I actually didn’t realize how very short TWGOK was. That makes bringing myself to watch it a lot easier, actually. Shorter shows are usually just easier to swallow.\n\nI agree about Kuragehime. I sort of like the idea, but some parts of it just seem to be executed so, so badly. I don’t mind surprises in shows, but this one seems to keep surprising me the wrong way. Also, some of the jokes get old quickly (like the petrification thing).\n\nAnd the promise of awful anime makes my inner flamesword (+1 against stuff I don’t like) flare anew."
                }
            ]
        }
    ]
}