{
    "Replies": [
        {
            "ID": "c2fm3ev7f64tkgl40st0",
            "Author": "Grant Walker",
            "Image": "http://0.gravatar.com/avatar/24cebad4d0079fc7fc502792cf522b2b?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2010 at 12:02 am",
            "Content": "Huzzah for tonight’s post! I’d post my thoughts on the anime shown, but since I already did that on Blackboard I feel like it would look too self-important of me to paste them here…\n\nI know I said this in a post that’s awaiting moderation for the first blog post, but I am seriously so psyched for Suzumiya.\n\nOtherwise, it looks like I made a mistake in grabbing Black Rock Shooter off of the hard drive earlier tonight; maybe I should just wait for the showing! I’ll probably keep posting as stuff happens, since I guess it’s “my thing” to be “the guy that posts” for now. So I shall totes be the guy that posts."
        },
        {
            "ID": "c2fm3ev7f64tkgl40stg",
            "Author": "Chaeha",
            "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2010 at 1:48 am",
            "Content": "I gotta say this because it’s the funniest thing that happened today. Well, for me anyway.\n\nSo, the voice actor of Recruit is Kamiya Hiroshi. (last name first.) He also did (as I found out today) Zess from Broken Blade!\n\nThen that 12-year-old just “happened to be” voiced by Hanazawa Kana, who played Kanade from Angel Beats.\n\nOh, I forgot to tell you Kamiya Hiroshi did Otonashi from Angel Beats.\n\nIt’s funny since Cleo likes Zess, just like Kanade likes Otonashi.\n\nIt would have been funnier if you showed BRS, because Hanazawa Kana is BRS.\n\nOr, rather, Kuroi Mato, because I don’t think BRS actually says anything.\n\nOr does she? It’s been so long I don’t remember.\n\nAlso at last week’s showing, Sakamoto Maaya played Nino-san from Arakawa and Mari from Evangelion,\n\nand Koyasu Takehito played Sister from Arakawa and Aoba Shigeru (aka the operator whose name nobody remembers) from Evangelion.\n\nI feel like you’re doing this on purpose…\n\nAnd by Disappearance, do you mean Haruhi? Because I really wanted to see it but all I could find was the cam recording. Well, anyway, I’m gonna start looking into the voice actors/actresses to see if there’s any more connection.\n\nThis could be anime version of Kevin Bacon Game or something."
        },
        {
            "ID": "c2fm3ev7f64tkgl40su0",
            "Author": "Alex",
            "Image": "http://0.gravatar.com/avatar/84017728603b52cc1816c62672c00aa1?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2010 at 7:44 am",
            "Content": "[http://encyclopediadramatica.com/Troll\\_face](http://encyclopediadramatica.com/Troll_face)\n\nYep, that pretty much sums it up."
        },
        {
            "ID": "c2fm3ev7f64tkgl40sug",
            "Author": "Chaeha",
            "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2010 at 2:40 pm",
            "Content": "This is important!\n\nI did some research on my own, and I found out that the new Touhou anime is NOT official. Zun is NOT involved, but people from Animate says it’s collaboration, which makes it sound like official, which makes Touhou fans angry.\n\nAnd the video you put up there (or the link to the video) is not the PV of the anime they are making. They made it as Reitaisai ad, or that’s the theory, and the Anime Tencho x Touhou anime is different, although they are made by same company. (Yes, it’s a company)\n\nAnd as for the production, it’s ufotable. If you haven’t heard of them, they did Kara no Kyoukai movies, and many more. Yes, they are professional, which helps the misunderstanding of the anime being official to occur. And it also explains the quality.\n\nThe anime is basically Anime Tencho 10th anniversary stuff, so I don’t know why they would put Touhou. As a big Touhou fan, I don’t feel really happy about them using Touhou to advertise their mascot character… but I guess I can’t really complain since pros are making Touhou anime.\n\nLong story short, whoever uploaded it on YouTube did not know what he/she was talking about, tricking us all (and probably him/herself). And as a big fan of Touhou, I am mad. Grrrr……\n\n(It’s all from a reliable source. It’s basically wiki for/by Korean otakus, so they know stuff. One day I wrote about a Touhou doujin game I didn’t really know and put “please edit and/or add” tag, and next day, it had a full, detailed description of the game. It includes that it was made by an unknown doujin group, but it turned out to be a well-known group for bugs in the game. I mean, that kind of stuff is hard to find. And unlike ED of Uncyclopedia, they don’t do it for fun, but to actually share information, so you can trust them.)",
            "Replies": [
                {
                    "ID": "c2fm3ev7f64tkgl40sv0",
                    "ParentID": "c2fm3ev7f64tkgl40sug",
                    "Author": "Chaeha",
                    "ReplyTo": "Chaeha",
                    "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "September 30, 2010 at 3:05 pm",
                    "Content": "Adding one more thing.\n\nThe ad for the 2nd ep of the Touhou doujin anime by Maikaze will be released (or was released. I don’t really know the date) at the 2010 Winter Comiket. We will hear more about it soon, hopefully…"
                }
            ]
        },
        {
            "ID": "c2fm3ev7f64tkgl40svg",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2010 at 11:39 pm",
            "Content": "\\\u003eimplying ED isn’t a legitimate source of information",
            "Replies": [
                {
                    "ID": "c2fm3ev7f64tkgl40t00",
                    "ParentID": "c2fm3ev7f64tkgl40svg",
                    "Author": "Chaeha",
                    "ReplyTo": "Gene",
                    "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "October 1, 2010 at 12:03 am",
                    "Content": "I said it not like ED, so it’s reliable."
                }
            ]
        }
    ]
}