{
    "Replies": [
        {
            "ID": "c2fm3477f64tkgl40rd0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 19, 2011 at 10:36 pm",
            "Content": "I agree that Madoka Magica is doing a very respectable job as a Mahou Shoujo, which I find amusing. It’s clearly a deconstruction of the genre, and yet it stands alone as a better Mahou Shoujo than most straight-up Mahou Shoujos. It has all of the elements – the mascot, the transformation sequences, the unique weapons – and it feels so well polished and believable even as it basically satirizes the genre. Sometimes, it doesn’t even feel so much like a deconstruction as it does just a very dark Mahou Shoujo.\n\nOn another note, I’m also watching Magical Girl Lyrical Nanoha at the moment, and it’s kind of funny. I keep expecting “shit to get real” even though I know Nanoha is a straightforward Mahou Shoujo.",
            "Replies": [
                {
                    "ID": "c2fm3477f64tkgl40rdg",
                    "ParentID": "c2fm3477f64tkgl40rd0",
                    "Author": "Chaeha",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "February 20, 2011 at 8:12 am",
                    "Content": "That’s one downfall of Madoka, I guess. It’s just like me after I watched Evangelion. I expected “shit to get real” in other shounen or mecha anime.\n\nAnd after I watched Evangelion, I wanted people to die in anime, and I like those animes where people (especially someone close to main character) die or get mentally broken down."
                }
            ]
        },
        {
            "ID": "c2fm3477f64tkgl40re0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 21, 2011 at 9:25 am",
            "Content": "This post made me watch Nanoha."
        }
    ]
}