{
    "Replies": [
        {
            "ID": "c2fm2077f64tkgl40o6g",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 4, 2010 at 12:36 pm",
            "Content": "I definitely overrate Shiki. It’s a good show, and compared to the rest of the shows this season, possibly even a great one. Shiki tends to stumble on slow storytelling early on, but it picks up down the road. I remember I didn’t watch it until I heard about how good the fourth episode was (that was this summer, by the way). After that I’ve been following it every Friday.\n\nWhile Shiki tends to get much of the praise, its impossible to overrate just how gruesome and generally depressing Narutaru gets. Especially in the manga. What’s nice about the anime is that they don’t get through all of the manga, but it still finishes on a complete thought. The manga barrages you so much high octane nightmare fuel that it gets hard to read. Like I said, the anime \u0026 manga continually one-ups itself in terms of how horrifying it can make the scenes and situations.\n\nDai Mahou Touge’s satire meter also increases linearly through the episodes.",
            "Replies": [
                {
                    "ID": "c2fm2077f64tkgl40o70",
                    "ParentID": "c2fm2077f64tkgl40o6g",
                    "Author": "Grant Walker",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "November 4, 2010 at 3:40 pm",
                    "Content": "I’m hoping Shiki gets more exciting. It’s interesting and all, but it still hasn’t distinguished itself as much as I keep thinking it should. I’m looking forward to seeing it pick up, though.\n\nAs for Narutaru… yeah, I’ll see eventually. Probably read it afterward, since it’s supposed to be the more extreme.",
                    "Replies": [
                        {
                            "ID": "c2fm2077f64tkgl40o7g",
                            "ParentID": "c2fm2077f64tkgl40o70",
                            "Author": "steve",
                            "ReplyTo": "Grant Walker",
                            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "November 4, 2010 at 5:47 pm",
                            "Content": "The thing about Shiki is that the first three episodes don’t really do anything except complete the exposition. However, the story is good enough that the show NEEDS 3 episodes of setting before anything can happen. Megumi is a pretty important character and what her life was like is important to how she evolves during the story, so she needs a full episode. I also thought the first episode was a great way to show how people starting dying. Natsuno is another important character whose interactions with the town and people in it influence the story, so he needs an episode of setting too. Ozaki and Seishin (the doctor and the monk) again are important characters whose interactions with the town and the people in it influence the story, so they need an episode of setting as well.\n\nStarting at episode 4, as i’m sure you can tell, the story starts. Each episode after 4 builds on the previous one and it just keeps getting better and better. Currently (episode 14) there are 4 interwoven storylines that are all excellent.\n\nUnfortunately, the sound issue (i.e., Matt’s computer) took a lot away from the show. I feel that the music is the second best part of the show (story, of course, being the best part). For anybody that is a fan of horror/psychological anime, this is a must see.\n\nSorry for wall… TL;DR:\n\nThis story REQUIRES 3 episodes of setting because of how epic the rest of the story is. WATCH IT!!!!!!!!!!!!!!!!"
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm2077f64tkgl40o80",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 4, 2010 at 12:45 pm",
            "Content": "Also, against all possible cosmic beliefs that we’ve shown _everything_ that is fit to be shown on disturbia night, I’ve combed through some shows in my collection and do have something in the works for next semester’s event. Should be some new stuff, and some old. Look forward to it!"
        },
        {
            "ID": "c2fm2077f64tkgl40o8g",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 4, 2010 at 1:00 pm",
            "Content": "I’ve never actually seen a significant amount of Shiki or Dai Mahou Touge, so I can’t comment on those shows, but like Gene said, it’s hard to overemphasize how messed up Narutaru can get. It’s a deconstruction of the mon genre, and shows just what screwed up things kids will do given the power. The series deals with taboo subjects like weather commentary, and it gets _very_ graphic later on, particularly in the manga.\n\nDeceptive OP is deceptive.",
            "Replies": [
                {
                    "ID": "c2fm2077f64tkgl40o90",
                    "ParentID": "c2fm2077f64tkgl40o8g",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "November 4, 2010 at 3:45 pm",
                    "Content": "I do have to admit some of Narutaru caught me off guard despite expecting some shit to go down. The wrist-cutting and the almost-genital-mutilation in particular surprised me.\n\nHoshimaru also scares me a little bit…",
                    "Replies": [
                        {
                            "ID": "c2fm2077f64tkgl40o9g",
                            "ParentID": "c2fm2077f64tkgl40o90",
                            "Author": "Gene",
                            "ReplyTo": "Grant Walker",
                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "November 4, 2010 at 6:05 pm",
                            "Content": "STAAAAAAAAAR"
                        }
                    ]
                }
            ]
        }
    ]
}