{
    "Replies": [
        {
            "ID": "c2fm3rn7f64tkgl40uq0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2010 at 11:38 pm",
            "Content": "Daniel’s the best media officer we’ve ever had. I should know, I was the first one and I was terrible :3"
        },
        {
            "ID": "c2fm3rn7f64tkgl40uqg",
            "Author": "Chaeha",
            "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 1, 2010 at 12:02 am",
            "Content": "Hey, I play rhythm games a lot myself. My favorite is Beat Mania series, although, to be honest, I’ve never played Beat Mania. There is a Korean game called EZ2DJ, and they are very similar, and Konami actually sued the Korean company, so they can’t make EZ2DJ anymore. Anyway, EZ2DJ is the one I played a lot. It’s focused more on the 5-key mode, while Beat Mania mostly uses 7-key mode, and EZ2DJ has pedal, which is, or was, totally new. After suing the Korean company, Konami decided to put pedals on Beat Mania. Those bastards… I don’t see why they aren’t suing Guitar Hero and Rock Band, which are just complete rip off of Konami’s Guitar Freaks and Drum Mania (and now Keyboard Mania since Rock Band 3).\n\nSadly, I haven’t played anything Beat Mania style, so I got quite bad. But I started playing new rhythm game called osu! (all lower case with ! at the end) and it’s pretty good. It’s basically Elite Beat Agent but people can make “maps” which are musics. It also has two special mode, which include Taiko mode, and since it’s from Konami, it may be sued soon. I hope not, though….",
            "Replies": [
                {
                    "ID": "c2fm3rn7f64tkgl40ur0",
                    "ParentID": "c2fm3rn7f64tkgl40uqg",
                    "Author": "DdR_Daniel",
                    "ReplyTo": "Chaeha",
                    "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "October 1, 2010 at 12:44 am",
                    "Content": "I used to play osu! a lot but haven’t played it in a long time now… I have Beatmania for PS2 but no Beatmania controller, but Mr. Biggs in Colorado Springs has a nice Beatmania machine and I play that occasionally. And then DDR, Stepmania, Pump-it-Up, a little DJ Hero and I’m okay at Guitar Hero. I’ve never heard of EZ2DJ though.",
                    "Replies": [
                        {
                            "ID": "c2fm3rn7f64tkgl40urg",
                            "ParentID": "c2fm3rn7f64tkgl40ur0",
                            "Author": "Chaeha",
                            "ReplyTo": "DdR_Daniel",
                            "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "October 1, 2010 at 8:16 am",
                            "Content": "There’s a funny story I have at Mr. Biggs in Colorado Springs. That’s where my high school had after prom, and it was first time I’ve ever been there. With my friend, I played Time Crisis 4 and spend all my money there, then I said, “I wish they had Beat Mania here” then he’s like, “They do, dude.” I was so sad that I had no money left…\n\nAnd I’m not surprised that you never heard of EZ2DJ. I don’t think it was released outside of Korea. When I saw Pump-it-Up at DnB, and it was the same version I used to play when I was in elementary school in Korea, I hoped that EZ2DJ was there too, but it wasn’t.\n\nIf I make enough money, I think I’m gonna buy one for my personal use. Wouldn’t that be awesome!",
                            "Replies": [
                                {
                                    "ID": "c2fm3rn7f64tkgl40us0",
                                    "ParentID": "c2fm3rn7f64tkgl40urg",
                                    "Author": "DdR_Daniel",
                                    "ReplyTo": "Chaeha",
                                    "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                    "Date": "October 1, 2010 at 11:32 pm",
                                    "Content": "You didn’t graduate from Liberty, did you? The year before my senior year, the after prom was held at Mr. Biggs, but when I was a senior it was just at the school.",
                                    "Replies": [
                                        {
                                            "ID": "c2fm3rn7f64tkgl40usg",
                                            "ParentID": "c2fm3rn7f64tkgl40us0",
                                            "Author": "Chaeha",
                                            "ReplyTo": "DdR_Daniel",
                                            "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                            "Date": "October 3, 2010 at 12:15 am",
                                            "Content": "You graduated from Liberty? Man, it was, like, few blocks away from my house, but since I needed (or they decided that I needed) ESL, so I went to Rampart. And today (or yesterday since it’s 12:13 right now) I went to see Rampart marching band competition, I also saw Liberty marching band. They were good, and certainly whole lot better than when I was in high school. It’s cool you went to Liberty."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm3rn7f64tkgl40ut0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 1, 2010 at 9:05 am",
            "Content": "It would be more awesome if the club got to use it too 😄"
        },
        {
            "ID": "c2fm3rn7f64tkgl40utg",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 1, 2010 at 2:12 pm",
            "Content": "Yo, Daniel! I’m Grant, and needless to say I don’t really do anything important, but I don’t think we’ve chatted in person before, so here I am.\n\nFirstly, much respect to you for being more awesome than me at pretty much everything. I’m rather horrible at mathematics and it just goes without saying that I can’t play rhythm games as well as you… I have played a handful, though, including osu! and some Rock Band (even though I know this rather pales in difficulty when compared to, say, ANY OTHER RHYTHM GAME EVER) and DJ Hero.\n\nI used to own DDRMax2 for the PS2, but I never got beyond Light difficulty for that. Would be fun to get back into it, but hey. I also still have to try both BeatMania and Stepmania still, bahh. You can tell I’m not too on the up-and-up with these things.\n\nAnyway, good to sort-of make your acquaintance, Daniel. I’ve definitely been hearing a lot about your video game badassery lately, so. 🙂"
        },
        {
            "ID": "c2fm3rn7f64tkgl40uu0",
            "Author": "Chris Lee",
            "Image": "http://0.gravatar.com/avatar/0c2d6c5d4e840c55a28a155fdb5d0340?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 1, 2010 at 8:38 pm",
            "Content": "Hi Daniel! It’s Chris, that asian kid that bothers you on occasion 😛 I’m mostly commenting to just say that you kick ass at video games, multitasking, math, and life in general. I love rhythm games myself; I used to play Guitar Hero/Rock Band pretty regularly, and I’ve dabbled in Stepmania. I occasionally visit a site called JamLegend, which is like a Guitar Hero-esque game for the keyboard. I’m thinking of tracking down Beatmania and graduating to seven buttons, heh.\n\nKeep kicking ass, man. I mean, uh, the _media officer_ sir."
        }
    ]
}