{
    "Replies": [
        {
            "ID": "c2fm3477f64tkgl40reg",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2010 at 5:33 pm",
            "Content": "I’m afraid I don’t know enough of the names to be able to put together a list of the one’s I’m looking forward to. Bakuman sounds the most interesting from the brief descriptions provided, but I haven’t read any of the manga or anything. Iron Man actually looks pretty cool, as well as Little Sister. I have little doubt that Arakawa 2 will be as good as 1. The Nippon Animation choices seem unique, if nothing else, but I don’t know if that means I will watch them…\n\nSame sort of thing goes for Panty and Stocking. Looks different, and I have a feeling it’ll be worth watching by virtue of being a Gainax production (not that I’ve seen that much Gainax, mind you, but I’ve enjoyed everything I HAVE seen–FLCL, Evangelion, some Gurren Lagann, maybe one or two others). I’m sure plenty others will sift through it and find out what the hits of the season will be a lot faster than I will, ha ha.\n\nAnd now I have an Economics exam to go figure out, haha; might get some work done on the anime I collected afterwards."
        },
        {
            "ID": "c2fm3477f64tkgl40rf0",
            "Author": "Chaeha",
            "Image": "http://0.gravatar.com/avatar/221dc820d1976e66ad40c0c0bc5f862a?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2010 at 8:44 pm",
            "Content": "I’m really excited for Bakuman. The manga inspired me in many ways, since I want to become a scenario writer someday.\n\nAnd I think I’m gonna watch Little Sister (and possibly read) because from what I heard it’s basically otaku justification light novel/anime, and I kinda need one about now. It’s very recent when I finally realized I’m an otaku, and I still think it’s not really a good thing, so if I watch that, maybe I’ll feel better. Oh, and did you hear? the endings are going to be picked from Nico Nico. 12 different videos will be picked and the winners get 100,000 yen each! I wish I had talent in writing music. To be credited in anime as a common people would be an awesome experience.\n\nOn the side, one of the new OVA is Tamayura. I watched the first episode of it, and it was pretty good. It’s one of those anime where you feel just relaxed and good and etc. It may be strange for a guy to like those, but they are my favorite. After watching the first ep, I was like, “Haa~.” Then I went to bed, and it was one of the best sleep I had.\n\nWell, that’s all I have for now. Now that I think about it, my favorite genres are psychological thriller, otaku style, and things like Tamayura. Hmm, why is there so much gap…"
        }
    ]
}