{
    "Replies": [
        {
            "ID": "c2fm22v7f64tkgl40oig",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "April 29, 2011 at 1:35 am",
            "Content": "Ookami-san’s narrator, Arai Satomi, did the voice for a certain character from Railgun.\n\nSee if you can guess which one: [http://www.youtube.com/watch?v=GE7efoloH6g](http://www.youtube.com/watch?v=GE7efoloH6g)\n\nI could just see her sitting with her feet propped up on a chair delivering every line with that goddamned look on her face. Needless to say, it made it virtually impossible for me to take the show seriously. KugiRie loli didn’t help. Otherwise, it was a decent (if somewhat lackluster) show.\n\nI watched the first couple episodes of Zombie with Gene a while back, and I wasn’t any more impressed this time than last time. I kinda applaud it for getting as ridiculous as it got (cross-dressing zombie guy with a chainsaw fighting a giant prawn in midair), but generally it was pretty bleh. Too much fanservice, pretty one-dimensional characters, and lolDEEN. Although I kinda want to watch Episode 7 to hear the Jellyfish Megalo (more Arai Satomi). Also, apparently, Eucliwood’s VA changed in virtually every episode (including Satoko’s VA in episode 2, nii-niiiiii~).\n\nGolgo 13 was patently ridiculous, but that’s okay. It’s kinda fun to watch someone who is so invincible he can bullshit his way out of anything, even it results in bad storytelling. I doubt I could sit through 50 episodes of it, but I wouldn’t mind watching one now and then.",
            "Replies": [
                {
                    "ID": "c2fm22v7f64tkgl40oj0",
                    "ParentID": "c2fm22v7f64tkgl40oig",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "May 3, 2011 at 1:08 pm",
                    "Content": "I suppose knowing that would definitely put a different perspective on things, yeah… That’s interesting, haha.\n\nMaybe I should be glad I didn’t have the pre-exposure, though."
                }
            ]
        },
        {
            "ID": "c2fm22v7f64tkgl40ojg",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "April 29, 2011 at 10:37 am",
            "Content": "After watching Railgun, it’s impossible to imagine Arai delivering lines with anything other than a perverted insinuation. Straight up impossible.\n\n\\~~~\n\nOokami-san is a solid 5/10 show. It’s short, midly entertaining, and manages to pack in all the Japanese High School Hijinks you’d expect to see, but otherwise doesn’t have much going for it. It is somewhat remarkable how they manage to reference so many different fairy tales without it coming off as too ridiculous (it is, of course, ridiculous at some level). The Three Little Pigs parody is probably the best one JC Staff pulls. Speaking of JC Staff:\n\n[http://db.tt/cOjn4qT](http://db.tt/cOjn4qT)\n\nHAHA JC STAPH U SO CLEVVER\n\n\\~~~\n\nZombieDesu starts off (IMO) as rather “eh,” drops into “bad,” then promptly wraps back around to “lolwut entertaining” for about an episode and finally settles back into “eh” territory. As you point out, it tries to be serious but it just falls on its face as it tries to shuffle between that and comedy.\n\n\\~~~\n\nI didn’t stay to watch Golgo 13, but the first hit on Youtube is an episode where he slides under an armored car and shoots through the muffler or something to kill the guy inside. Lulz."
        }
    ]
}