{
    "Replies": [
        {
            "ID": "c2fm31n7f64tkgl40r70",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 25, 2010 at 6:09 pm",
            "Content": "I always found it strange that we tend to call it Turkey Day. Like on Mother’s Day, we give our mom flowers and stuff. And on Father’s Day, we buy him beer and let him watch football, and stuff. But on Turkey Day, we butcher them and eat them to celebrate Indians or something. Oh well. Shikata ga nai.\n\nAlso, long-post ended up being like 6000 words. I think this blog has some kind of internal size limit, because after a point, the page would start breaking every time I updated the draft or previewed it. Like captions dislodging, pictures showing up in weird places, entire bits of text getting deleted, the color of my font changing, and the date changing to a week ago. It was weird, like all Twilight Zone-y.",
            "Replies": [
                {
                    "ID": "c2fm31n7f64tkgl40r7g",
                    "ParentID": "c2fm31n7f64tkgl40r70",
                    "Author": "Gene",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "November 25, 2010 at 11:18 pm",
                    "Content": "Sounds like what happens when you reach the 256th level of pac-man. The screen gets all muddled and the colors start changing. Awesome job though, it looks fine."
                }
            ]
        },
        {
            "ID": "c2fm31n7f64tkgl40r80",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 28, 2010 at 3:23 am",
            "Content": "I, too, have been rather tragically unproductive. I don’t think I’ve watched a single episode of anime this entire break, and it hurts inside.\n\nKind of sad to hear there’s not much in the way of series coming out next semester, but on the other hand, wouldn’t that also be a good supply of material for a ‘Bad Anime Night’ or something like it? Unless a lot of the offerings just aren’t _bad enough_."
        },
        {
            "ID": "c2fm31n7f64tkgl40r8g",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 28, 2010 at 11:12 am",
            "Content": "It won’t be Bad Anime Night when _every_ night is Bad Anime Night! Hohohohohoho\n\nBut really, I’m sure Gene will find a way. Worst comes to worst, you could just show stuff from past seasons that haven’t been shown at Anime Club before.\n\nAnd in terms of productivity, I’ve managed to watch 3 episodes of Mushishi, the new Index (faaaaaannnnnservice), and finish Planetarian (a short VN). I also got virtually zilch done on my EPICS project. I rule."
        },
        {
            "ID": "c2fm31n7f64tkgl40r90",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 28, 2010 at 12:55 pm",
            "Content": "I accomplished no productivity in the anime department primarily due to Steam running a Thanksgiving/Black Friday sale.\n\nI did, however, pick up Recettear and play several hours of it, so that’s close enough, right? Right?\n\nEh, whatever.\n\nCapitalism, ho!"
        },
        {
            "ID": "c2fm31n7f64tkgl40r9g",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 29, 2010 at 12:09 am",
            "Content": "Am I the only one that stayed caught up with the 10 series he’s watching?\n\nFUCKYERFAES.jpg\n\nGene, Yosuga no Sora is awesome, just admit it. Besides, Sora’s arc is coming up and Sora arc is best arc."
        }
    ]
}