{
    "Replies": [
        {
            "ID": "c2fm22n7f64tkgl40oh0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "April 21, 2011 at 3:46 pm",
            "Content": "Hale and Guu is pretty refreshingly unique for me, but I agree, a lot of it just went too far to the point of feeling… well, I dunno, inane I guess is the best word I can use to describe it. It feels almost a little too “slice of lifey” with a premise that is anything but.\n\nStill watching Steins;Gate; ep 3 was great. I spent most of the first two episodes wondering how Makise Kurisu’s jacket stayed on despite nearly falling off, but apparently it’s held up by belts on each arm. Huh.\n\nGlad you liked Alien Nine, it needs a sequel badly. I was wondering if you found it dated at all…? I know the art bothers some people, but I don’t think I’ve ever seen anyone bothered by the turns in the plot, despite being one of the more convoluted aspects of the show (why do they even let these kids fight aliens?).\n\nLevel E and Tiger \u0026 Bunny I don’t care about. Fractale kind of drags it’s feet in pseudo-intellectualism near the end, but everything in between is pretty great. Soundtrack is baller. Ending is one of the more surprising twists I’ve seen in anime. Doesn’t save the show, in my opinion, but wow, it’s a twist nearly on M. Night Shyamalan proportions.",
            "Replies": [
                {
                    "ID": "c2fm22n7f64tkgl40ohg",
                    "ParentID": "c2fm22n7f64tkgl40oh0",
                    "Author": "Grant Walker",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "April 22, 2011 at 11:27 am",
                    "Content": "I definitely agree Hale and Guu was unique. The whole jungle setting was about as new as new could be.\n\nGood to hear ep 3 of Steins;Gate is good; I should grab some of that! But yeah, her jacket is a little confusing. Not only the physics of it but the questionable style.\n\nThe art was definitely different in Alien Nine, but I wouldn’t say it was dated. It doesn’t look like Narutaru or anything. I don’t think I’ve seen anything quite like it.\n\nI’ll probably finish Fractale, if only to see more airships and stuff, because I like that sort of thing (those and the huge amount of color remind me a little of Miyazaki stuff, which is good)."
                }
            ]
        },
        {
            "ID": "c2fm22n7f64tkgl40oi0",
            "Author": "Matthew Strand",
            "Image": "http://1.gravatar.com/avatar/91f41592590fd4634f415235b340d622?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "April 27, 2011 at 9:37 pm",
            "Content": "I found Hale and Guu disturbing, so it fit with the night’s theme. I agree with Gene that Alien 9 desperately needs a sequel or continuation, and found the art nice enough; it didn’t seem dated. I really need to get Stein’s;Gate though. It seems almost as interesting as Noein."
        }
    ]
}