{
    "Replies": [
        {
            "ID": "c2fm2of7f64tkgl40qlg",
            "Author": "dante",
            "Image": "http://1.gravatar.com/avatar/b0a5ad3c3df8b9534c485dda177c729c?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 20, 2012 at 3:10 pm",
            "Content": "The hell? This site has reviewers now? Where’s that other guy with the insightfully long-winded commentary? You know….Chris.\n\nAccel World –\n\nThere’s not enough speed lines in the world to illustrate how fast these people should be going out and doing something useful with this power. That said, while an extra 15 minutes at a moment’s notice sounds terribly abusive, the counterbalance is that you can’t physically DO anything during that “time.” Burst Mode is great for when you need time to overly think a difficult situation or formulate a plan, but you won’t be able to learn anything, or research anything, or develop anything tangible, not to mention this power means nothing if you lack effective short-term memory.\n\nSo with the rewards being limited, so are the risks. No physical injuries are sustained in Accel World, and once you run out of Burst Points, you can’t think faster anymore. Awww, I guess they’ll just have to go back to the designer neuro-drugs that will surely exist by 2046. The idea of levels also seems absolutely contrived, since you basically have to 1-shot every other strongest player IN A ROW, just to “win” and meet the game creator. So in the end, yes it’s just a game, but it’s an anime game, so it’s melodramatic.\n\nNow let’s talk about Haruyuki. This guy is more otaku than most of the anime industry cares to admit, and of all things, it exposes a weakness in the industry as a whole. Yes, he’s fat, and he’s short, and he’s awkward as hell, and he looks like an even-more-deformed chibi Simon. In fact, his character is so unusual that he doesn’t even share the same animation style with anything else in the show. It’s literally as if animators just cannot draw “fat.” Though that does raise an interesting question. Is a “boku wa” protagonist any less annoying with an attractive character design? The widespread belief is that main characters should never be fat because that would imply that viewers would aspire to emulate them (and apparently their character designs). However, I submit that one’s character is largely independent of their form (regardless of nature vs nurture arguments). As such, I doubt many people would mind a character with a non-idealized design, but the execution and animation has to be well-done and consistent. However, here Haruyuki’s stark animation difference is just too jarring, and until industry animators can figure out how to draw atypical characters, this will remain a rare oddity in an ever growing CG cell-based world.\n\nNatsuiro Kiseki\n\nIf you liked what Sengoku Collection did to Japanese history, then you’ll love what Natsuiro Kiseki has done to the Asshole Row of CSM Anime Club. All of the tropes are there: Daniel, Chaeha, Chris, and Gene. Even I play a cameo as a fucking rock (this show is deep). Most of the shenanigans are character driven, but the rock obviously augments this to a far more entertaining level. I also love how the girls are more-or-less at the mercy of the whims of a boulder, yet they keep using it, and often to drive an otherwise angsty middle school story. You may not be able to squeeze blood from a rock, but you can apparently squeeze quite a few laughs out of a troll stone.\n\nNatsuyuki Rendezvous\n\nSetting aside the obvious questions that arise while watching Josei anime, Natsuyuki Rendezvous asks a truly rare question for the genre: what should the main love interest do when both choices are petty jerks? The answer is a bit surprising. The series also takes Josei’s trademark aspects of unrequited love to the utmost extreme: spouses who love one another long after “till death do us part.” This is where Ryosuke steps in. He deeply loves Rokka, and she’s technically single. Yet fate decides to troll Ryosuke by letting him see her dead husband, who has until now been completely amicable and pleasant. As soon as Ryosuke decides to claim Rokka for himself, however, Atsushi becomes a meddling ass. Ryosuke, who himself bears a thin, flexible membrane of a personality, is obliged to respond in kind. Throw in some shameless manipulation and Atushi’s oft-appearing older sister, and you have another 6-hour marathon of pure angst…and the weirdest 3-way you’ve ever seen.\n\nCan’t wait to hear what you have to say about last week next week – wow, you’ve even more behind than I was when I started this job.",
            "Replies": [
                {
                    "ID": "c2fm2of7f64tkgl40qm0",
                    "ParentID": "c2fm2of7f64tkgl40qlg",
                    "Author": "c0mpl3x1ty",
                    "ReplyTo": "dante",
                    "Image": "http://1.gravatar.com/avatar/d7a098ca0e524a25a53cd17ac7b261c0?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "September 21, 2012 at 2:12 pm",
                    "Content": "You would be the fucking rock.\n\nFuck that rock. Shadow-governing the anime club was one thing but had go for my day-to-day loli middle school adventures too."
                }
            ]
        }
    ]
}