{
    "Replies": [
        {
            "ID": "c2fm2fv7f64tkgl40pq0",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 7, 2011 at 5:15 pm",
            "Content": "Winter Break’s the best break. It’s not too short to get into a non-curricular activity (like Thanksgiving or Spring Breaks) or too long to get through without winding up bored (like Summer Vacation). There’s 4ish days left until classes start again, and I’m just about ready to get back into classes. Wish we could could swap to a year-round school year with WB-length vacations, but you know, politics. Or something.\n\nAlso, I _finally_ got through all the anime from Fall 2010 that I wanted to finish before putting together a “year in review” piece for the blog. (Well, I guess I have the Megana na Kanojo OVAs left) I would have finished earlier I think if not for the ridiculous rewards for a certain Wintersday quest in Guild Wars. Said quest rewards were farmed so hard by everyone (myself included) that _two sectors of the in-game economy all but crashed_. Ugh.\n\nNow to go actually write that piece. Or read more HP and the Methods of Rationality. Hmmmm.",
            "Replies": [
                {
                    "ID": "c2fm2fv7f64tkgl40pqg",
                    "ParentID": "c2fm2fv7f64tkgl40pq0",
                    "Author": "Gene",
                    "ReplyTo": "Jack",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 7, 2011 at 5:22 pm",
                    "Content": "Wow, fanfiction takes precedence over anime club? Wait a second, I’m not surprised by this at all! I finally gave you a user so you can post your list. I’m interested so feel free to make it happen.\n\nI actually heard about the rewards wintersday (on /v/) because of all the bitching when the economy was dying. The rage was priceless.\n\nAlso Megane na Kanojo was pretty fun, they’re short, at least. Mercifully short, actually. 😉"
                }
            ]
        },
        {
            "ID": "c2fm2fv7f64tkgl40pr0",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 7, 2011 at 6:23 pm",
            "Content": "At least you watched anime, sir. I’m ashamed to say that I really didn’t get any viewing at all, except for rewatching some stuff I’ve already seen (Disappearance, Girl Who Leapt Through Time, FLCL, stuff…). I guess there was that one episode of Amagami…\n\nThat is, unless playing the story mode in BlazBlue counts as watching anime. I guess the lack of actual _animation_ (unless seeing the portraits go omnomnom during dialogue counts) excludes it, though.\n\nI’ve seen the pilot of Dexter, and yeah, it doesn’t look too terrible. My better half is obsessed with the novels, so I end up hearing a lot about it, but I’ve yet to try diving in.\n\nAnyway, I don’t have anything particular to say about the coming semester’s shows, since I… haven’t… seen them, but I’m hoping for some good showings! I’ll probably be pleased either way, though. I’m not exactly the most selective audience."
        },
        {
            "ID": "c2fm2fv7f64tkgl40prg",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 8, 2011 at 12:08 am",
            "Content": "Somehow looking forward to going back in a few days. Schedule’s a bit more open, and I’ll actually be able to attend showings on time this semester. First half of winter was pretty much video games and anime (finished Mushishi), and second half went to recovering from wisdom teeth extraction, which means it also consisted of video games and anime (almost finished with Black Lagoon, which I am really enjoying).\n\nDespite Winter 2011 failing to impress me, I’ve decided to give it a chance, so I’ll try to watch at least 2-3 episodes of everything that comes out. Infinite Stratos looks pretty much set to dive into the standard harem recipe (as if one couldn’t tell from the premise). Unless it deviates and gets interesting, fast, I probably won’t finish it. Or maybe I will – I finished K-On!!, after all. Madoka gives me mixed feelings. It feels so ordinary and cliche, but the Shaft artstyle never fails to be interesting. It’s weird. It’s like being served Taco Bell on a silver platter, at a fancy restaurant, in an airport.\n\nI’m waiting to see if anyone else is subbing Gosick before I reluctantly take the HS 480p. I hope a decent group subs it in HD, because it’s one of the few shows I was planning on watching this season anyway.I’m grabbing Cardfight now…although I can’t really say I’m looking forward to it.\n\nOh, right – You can’t have Bad Anime Night when _every night_ is bad anime night! Ohohohohohohoho"
        },
        {
            "ID": "c2fm2fv7f64tkgl40ps0",
            "Author": "Daniel Pascua",
            "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 8, 2011 at 6:15 pm",
            "Content": "I agree that this break seems like just the right length, and I’m just starting to feel like going back to school again. I’ve gotten into fighting games now so I’ve spent most of my break playing Super Street Fighter 4 and Blazblue. You’ll have to show me that Umineko game sometime Gene. 😄",
            "Replies": [
                {
                    "ID": "c2fm2fv7f64tkgl40psg",
                    "ParentID": "c2fm2fv7f64tkgl40ps0",
                    "Author": "Gene",
                    "ReplyTo": "Daniel Pascua",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 8, 2011 at 7:16 pm",
                    "Content": "You got it Daniel, I already put it on the hard drive. I’ll hook you up with it next time I see you 😄"
                }
            ]
        },
        {
            "ID": "c2fm2fv7f64tkgl40pt0",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 9, 2011 at 12:37 am",
            "Content": "So I heard an interesting statistic about this most recent Comiket.\n\n40% of all ero dojinshi were of Kuroneko. Lol Japan…",
            "Replies": [
                {
                    "ID": "c2fm2fv7f64tkgl40ptg",
                    "ParentID": "c2fm2fv7f64tkgl40pt0",
                    "Author": "steve",
                    "ReplyTo": "steve",
                    "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 9, 2011 at 12:41 am",
                    "Content": "also lolwtf… people in this club play blazblue?\n\nCOME AT ME BRO",
                    "Replies": [
                        {
                            "ID": "c2fm2fv7f64tkgl40pu0",
                            "ParentID": "c2fm2fv7f64tkgl40ptg",
                            "Author": "Grant Walker",
                            "ReplyTo": "steve",
                            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 9, 2011 at 12:39 pm",
                            "Content": "It’s so _anime_, I can’t not play it.\n\nI’m also horrible, though, so I should probably just stop trying."
                        },
                        {
                            "ID": "c2fm2fv7f64tkgl40pug",
                            "ParentID": "c2fm2fv7f64tkgl40ptg",
                            "Author": "Gene",
                            "ReplyTo": "steve",
                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "January 9, 2011 at 6:31 pm",
                            "Content": "Last time I played you I got my butt rocked\n\nbut good luck everyone else!"
                        }
                    ]
                }
            ]
        }
    ]
}