{
    "Replies": [
        {
            "ID": "c2fm26f7f64tkgl40ov0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 19, 2011 at 1:27 am",
            "Content": "Wow, this club sounds lame. I bet you’re as lame as you look in that picture. Especially the guy on the right, wtf is his problem? And the one to the left of him is probably a moron. (The guy on the far left though, he looks like a classy gent. I have no idea why he would hang out with losers like you.)\n\nMan, I bet none of you guys watch anything good. I mean, seriously. Is that stuff in the picture the kind of garbage you show? Iroha is such a boring SoL, and AnoHana was just a mess of poor writing and forced drama. Steins;Gate is one of the worst shows I’ve seen this year, and the science is so poorly explained. Not to mention it has Hanazawa Kana in it, who is clearly the worst and most annoying voice actor ever. And Madoka? Really? Soooooo overrated. You probably like it because it’s popular.\n\nThis is so sad. I can’t believe you’re the longest running club in Colorado. I am filled with sorrow and pain knowing that such a club is tainting the university I will be studying at for the next four years. I’ll go, but only to show you guys what REAL anime is like.\n\nDon’t get the wrong idea. I-it’s not like I want to get to know you or anything, sheesh. It’s just that I happen to have some time on Wednesday evenings, and I need to educate you guys so you can stop being a walking insult to the entire anime fanbase. And I-I guess I can stick around after showings, so I can show you how to stop sucking at video games. You’d better be grateful! I don’t like you or anything! Stop having such pervy thoughts! You’re so disgusting!",
            "Replies": [
                {
                    "ID": "c2fm26f7f64tkgl40ovg",
                    "ParentID": "c2fm26f7f64tkgl40ov0",
                    "Author": "Daniel",
                    "ReplyTo": "Chris",
                    "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "August 19, 2011 at 6:30 pm",
                    "Content": "You sound pretty lame to me. I think I’m gonna come just to see what your idea of “REAL” anime is like. And showing people how to stop sucking at video games. Pshhh what do you play? Let me guess… Call of Halo or something?"
                }
            ]
        },
        {
            "ID": "c2fm26f7f64tkgl40p00",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 19, 2011 at 3:35 pm",
            "Content": "oh wow!! this club sounds like so much fun i can’t wait to see what happens at the first showing (((: i’ll bring my naruto headband and inuyasha ears and we can just make a party out of it lol! i hope the dues get me one of those nifty mustaches too cuz they look just like the one morio wears!!! LOL jk\n\nmaybe i’ll even stick around after so we can talk about one piece (best anime ever, fact) and i can show u guys how good i am at call of halo 8D\n\ncan’t wait for the show!!!!! =)",
            "Replies": [
                {
                    "ID": "c2fm26f7f64tkgl40p0g",
                    "ParentID": "c2fm26f7f64tkgl40p00",
                    "Author": "Daniel",
                    "ReplyTo": "Grant Walker",
                    "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "August 19, 2011 at 6:35 pm",
                    "Content": "I don’t know, I don’t see any Naruto in that pic. And just look at those guys, they don’t look like “casuals,” if you get what I mean. Oh well, guess we’ll just have to go and see."
                }
            ]
        },
        {
            "ID": "c2fm26f7f64tkgl40p10",
            "Author": "Daniel",
            "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 19, 2011 at 6:17 pm",
            "Content": "…\n\nIf it’s okay for people to sneak in the back and hide out and never really say anything, then maybe I’d come and sneak in the back and hide out and never really say anything.\n\n…\n\nAlthough if you have DDR, I’d come just for that. (Or Mario Kart wii. Or maybe Touhou. Or Blazblue.)"
        },
        {
            "ID": "c2fm26f7f64tkgl40p1g",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 20, 2011 at 1:11 pm",
            "Content": "I guess you should also delete my posts if you haven’t done it. Most of them I didn’t change the size of pictures cause I didn’t really know much about how I should post stuff, and I generally try to get over-sized pictures.\n\nAnd who is this Chris guy? Saying bad things about Hanazawa Kana. Man, you and I are gonna have a talk.\n\nHey, Gene, there’s a better game to play after the showing than Touhou 13. I mean, Touhou 13 is awesome, but it’s a single player game. It’s called Griefsyndrome, and I’ll bring that.\n\nOh, btw, did you see Toyosatomimi no Miko? Man, she looks so cute. Then again, is there anyone not cute in Touhou?",
            "Replies": [
                {
                    "ID": "c2fm26f7f64tkgl40p20",
                    "ParentID": "c2fm26f7f64tkgl40p1g",
                    "Author": "Chris",
                    "ReplyTo": "Chaeha",
                    "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "August 20, 2011 at 4:45 pm",
                    "Content": "/troll off\n\nI saw pictures of Grief Syndrome. How is it? It basically looked like Metal Slug with Madoka. Which is awesome.\n\nAlso, I think I’ve finally gotten the last key to Rock Band customs. I’ve figured all the vocals and lyrics stuff out, and I just found that you can play them on an unmodded Xbox 360 through Rock Band 3 by using some programs to disguise the customs as DLC. And as it turned out, Rock Band 3 only cost 20 bucks new, so I picked it up. Gonna go into testing soon.\n\nHow did Freshman move-in go? Hopefully you guys were able to get some posters up. I was at TA training all day yesterday and today, so I wasn’t able to check it out. The traffic was terrible, though.",
                    "Replies": [
                        {
                            "ID": "c2fm26f7f64tkgl40p2g",
                            "ParentID": "c2fm26f7f64tkgl40p20",
                            "Author": "Chaeha",
                            "ReplyTo": "Chris",
                            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "August 21, 2011 at 6:58 pm",
                            "Content": "Grief Syndrome is the most amazing doujin game out of C80. Well, I guess it’s debatable since Touhou 13 also came out in C80. Well, actually, other games were pretty amazing too, like this one Touhou RTS I got. Doujin games are just getting better and better, and I like it.\n\nBut it’s still awesome.",
                            "Replies": [
                                {
                                    "ID": "c2fm26f7f64tkgl40p30",
                                    "ParentID": "c2fm26f7f64tkgl40p2g",
                                    "Author": "Gene",
                                    "ReplyTo": "Chaeha",
                                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                                    "Date": "August 21, 2011 at 6:59 pm",
                                    "Content": "Woah woah woah, Touhou RTS. I must find this now."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm26f7f64tkgl40p3g",
            "Author": "Steve W",
            "Image": "http://1.gravatar.com/avatar/1f28be129fe5df07bdab24b2487abc22?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 21, 2011 at 12:19 am",
            "Content": "lol we’re scaring people away before they even show up GOGO US!"
        },
        {
            "ID": "c2fm26f7f64tkgl40p40",
            "Author": "Kevin L",
            "Image": "http://1.gravatar.com/avatar/73754489fd80b8f43d0b7ec52828324d?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "August 24, 2011 at 2:48 am",
            "Content": "Man, I’d be much more excited about us featuring C if I hadn’t already seen it… But then again, if I hadn’t already seen it, I might not be excited either. Well, it was good enough for a second watch, so whatever."
        }
    ]
}