{
    "Replies": [
        {
            "ID": "c2fm23n7f64tkgl40okg",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "September 30, 2012 at 10:18 pm",
            "Content": "Cool stuff. I just finished 1cc’ing all the main games this summer on normal, and you’ve inspired me to go back for Extra completion (that, and Hard mode felt kinda boring). By the sounds of it you went from nothing to 1cc’in hard or lunatic in the space of the summer? If so, that’s impressive. I must be kinda bad or just too casual since it’s taken me a few months off and on to work up to hard.\n\nEoSD was easily my least favorite (and thus the last one I bothered to 1cc on normal). The graphics were muddy and some of the patterns just felt unfair (in particular, Cirno’s opening nonspell comes out of fucking nowhere and Sakuya’s Eternal Meek is “hope you get a decent pattern.”) I’d also make a claim that Stage 4 is the most direct “l2stream or die” stage in the series (even though once you do laern it becomes incredibly trivial). The gme has a lot of iconic stuff going for it, though.\n\nPCB … I don’t remember all that much. Mostly I just remember border/bomb/death spamming my way through Yuyuko’s ressurection.\n\nIN is absolutely the best place to start with the series. ZUN finally figures out how to not make the game look entirely like a muddy mess of pixels, there’s a(n overly) generous deathbomb window, solid-yet-not-overwhelming spellcards, and as you mentioned, _Spell Practice_. Being able to just rapidfire test out strategies on different cards is great, and part of the reason I loved StB/DS so much. Easiest in the series by far, which makes it a great stepping stone into the series or from difficulty to difficulty. If only I could manage to not be so freaked out by Marisa’s star bullets…\n\nPoFV: Hahaha yeah\n\nMoF was ridiculously hard for a while. Then I found out you should ignore Peppy’s advice regarding bombs. Much easier after that. I’m still sore about how the hitbox on Kanako’s shard bullets is a little off (rectangle vs. oblong shape) leading to ridiculous amounts of clipdeath on her patterns.\n\nSA. Ah, SA. For when you think you’re getting good at Touhou, and need a little humility. By ghost wheel, I take it you mean Orin’s Needle Mountain card? If so, I’m totally with you on hating that thing. Worse than curvy lasers when it comes to reading it in peripheral vision. Speaking of …\n\nUFO does have a curvy laser fetish, and I really hate it for it. Probably a bigger problem, IMO, than the glut of pickup items. Not that that wasn’t an issue too; I remember my early attempts at stage 5 being plagued by bullets hiding in clouds of score cards. Not fun. I loved Byakuren’s theme; easily my favorite in the series.\n\nTD is getting a bit of a rough shake from you, I think. It got rid of the curvy laser fetish, and the spirt pickups are at least a noticeably different color and shape from any existing bullet (and they don’t move, either). It was nice to have spell practice back, though, so hopefully ZUN keeps that in for 14.\n\nIf I had to pick a favorite … I guess I’d go with Imperishable Night as well. Everything (levels, patterns, bombs, characters, music, gimmick, spell practice) is just so solid.",
            "Replies": [
                {
                    "ID": "c2fm23n7f64tkgl40ol0",
                    "ParentID": "c2fm23n7f64tkgl40okg",
                    "Author": "david",
                    "ReplyTo": "Jack",
                    "Image": "http://0.gravatar.com/avatar/434cdb349fe4302431bb4c57617aca60?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "October 1, 2012 at 1:45 am",
                    "Content": "Based on your response I guess I came off sounding better than I actually am. I am not even close to 1cc’ing all of them on hard. I think i have only done 6,7,8 on hard and no lunatic yet, but i have come pretty close on 7. I just love playing on the higher difficulties. 90% of my play time in the games comes from practice mode. My usual pattern is blind run, couple practice runs on problem stages, 1cc normal, extra, unlock all stages on harder difficulties burning all continues in the process(or being hella persistent on games like SA with weird continue system), then just play random stages in practice mode and never touch the main mode again. And you are right i was pretty harsh on TD, but i was too tired of typing to add anything positive. I still think it is fairly weak overall, I just didn’t find any of the patterns particularly fun, and most of the stages felt like a waste of time. But nearly as useless as the UFO stage 6 and its incredibly boring 3 minutes of mindless space invaders. But i did love stage 6 of TD and its pretty much the only thing I touch whenever I start that one up. As for Marissa in IN just keep doing Milky Way card and Non directional laser until you can do both 5 times in a row and then you will never have trouble with star bullets again. I used to hate that fight but now i rarely die at all"
                }
            ]
        }
    ]
}