{
    "Replies": [
        {
            "ID": "c2fm36v7f64tkgl40rug",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "July 19, 2011 at 2:03 am",
            "Content": "[http://upload.wikimedia.org/wikipedia/commons/d/d3/Hatsune\\_Miku\\_Corolla.jpg](http://upload.wikimedia.org/wikipedia/commons/d/d3/Hatsune_Miku_Corolla.jpg)\n\nTrololololol\n\nI just realized the driver can’t see out the back windows to check blind spots. That’s okay, Miku will look for you! Right? Then again, maybe other cars will stay the hell away from you in that thing.\n\nAnd because I’m too lazy to make a separate post for it, hijacking the comment box. ITT Summer Anime QQ’ing.\n\nBaka Test 2 is the only thing I’m really excited for. I’m only watching 2 other things this season, and they both start with Kami-sama. One because the OP and ED are performed by my favorite vocalist, and I feel obligated to watch it. The other because it looks like an urban version of Gosick, and I at least need to pretend like I care about this season. Oh yeah, and Higurashi Kira, but that’s an OVA, and doesn’t count. Hibernate until delicious Fall season. And maybe catch up on all the Winter stuff I ignored while Madoka was airing.\n\nOh yeah, Hanazawa Kana is in the following:\n\n-Kamisama Dolls\n\n-Morita-san wa Mukuchi\n\n-Ro-Kyu-Bu\n\n-Mayo Chiki!\n\nGonna go ahead and lol at the entire voice cast for that last one. I know all but one of them (Mogami Tsuguo?), and it sounds like a terrible show. What a waste of talent.",
            "Replies": [
                {
                    "ID": "c2fm36v7f64tkgl40rv0",
                    "ParentID": "c2fm36v7f64tkgl40rug",
                    "Author": "Chaeha",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "July 19, 2011 at 8:49 am",
                    "Content": "So, I guess the one you are watching because of the vocalist is Kami-sama Dolls. The other one looks interesting, too. I fear it’s gonna be like So Ra No Wo To or Fractale, where the original concept art looks amazing, and the actual anime is just generic. I mean, it’s the same guy who did original concept art for So Ra No Wo To.\n\nOh, and the one who did OP for the other Kami-sama show is Choucho, who is a Nico Nico Singer, and I have one of her songs by a total coincidence, and it’s so good. The people from Nico Nico are going pro more and more now.\n\nI looked up Mayo Chiki, and it does look bad. But Ro-Kyu-Bu looks also bad. Well, if Ro-Kyu-Bu’s not horrible beyond words, then I guess I can watch for the VA’s. I mean, Ogura Yui? Hidaka Rina? How can I not watch a show with those two? (And of course Hanazawa Kana but that’s kinda obvious. I mean, I don’t watch many shows without her, but that’s mostly because she’s, like, in everything!)\n\nI may watch Blood-C because original character design/original story is by Clamp. As a fan, I can’t really miss this, although I haven’t watched Code Geass. But they didn’t do the story as far as I know, so it doesn’t count, right?\n\nAnd when will I have my own itasha like this?\n\n[http://www.zimbio.com/pictures/de54cpAhBqx/Itasha+Festival+Takes+Place/XewuLGjJqM6](http://www.zimbio.com/pictures/de54cpAhBqx/Itasha+Festival+Takes+Place/XewuLGjJqM6)"
                }
            ]
        },
        {
            "ID": "c2fm36v7f64tkgl40rvg",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "July 19, 2011 at 8:10 pm",
            "Content": "yeah I forgot to tell you this Chris. I got Rewrite, and it looks promising. Well, I haven’t played it much. One thing I hate is the guy friend, or a rival, I don’t even know their exact relations, because he is so dumb. The first thing he says is “let’s duel” like in Yu-Gi-Oh. And everything he says is stupid. Remember the gag parts in Angel Beats where they are not timed right? Well, it’s worse than that. I don’t know much about Tanaka Romeo, but I wish Ryukishi was not writing this. It just doesn’t feel like a Key game if he’s in it."
        }
    ]
}