{
    "Replies": [
        {
            "ID": "c2fm31f7f64tkgl40r4g",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 4, 2011 at 8:40 am",
            "Content": "Anime? What’s that?\n\nThose pictures look **awesome** by the way. I had no idea Mt. Fuji was so freakin’ massive. God, you don’t live next to the train do you? Hope you’re not having some sort of Blues Brothers experience! Best wishes!\n\nFound your skype but the steam profile link didn’t work."
        },
        {
            "ID": "c2fm31f7f64tkgl40r50",
            "Author": "Chaeha",
            "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 4, 2011 at 10:56 am",
            "Content": "That is so cool. I tried to go to Japan few times now, but I had no money……\n\nHopefully I’ll go before I die.\n\nIt’s kinda funny that Korean cities are more packed, and I’m used to that. I didn’t live in the big cities like Seoul, or even in the downtown part of my city, but you wouldn’t see sky unless you turn your head directly up because of tall buildings everywhere.\n\nI’m pretty sure Japanese public transportation system’s really good, so even if you do get lost, if you know where you are going, you can find the way with a map of bus and train routes. It’s just that you lose so much time.\n\nYou’d think that Japan will be full of anime, but I have this feeling that otakus are still not fully welcome even in Japan. I didn’t see online game ads in Korea, and I’m sure PC online games in Korea is like anime in Japan. One thing to learn from this is that we can’t assume something from the limited information we know.\n\nHope you have fun.\n\nPS: If you are fan of Higurashi like me, be sure to visit Shirakawa-go when you get time. [http://www.japan-guide.com/e/e5951.html](http://www.japan-guide.com/e/e5951.html) explains everything."
        },
        {
            "ID": "c2fm31f7f64tkgl40r5g",
            "Author": "aosecky",
            "Image": "http://0.gravatar.com/avatar/c1bf7c5e26dc543010196b453b467b3c?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 4, 2011 at 4:55 pm",
            "Content": "I think a ton of people do live right next to the train tracks. I have a lot more pictures I stuck on my facebook pages. There are tons of houses just packed next to the rail roads. I mostly got on the wrong train because I had 10min to catch the train so I just jumped on the one that was about to leave. For my steam try: [aroxang@yahoo.com](mailto:aroxang@yahoo.com)\n\nI always forget what I need to give to people to have it work.",
            "Replies": [
                {
                    "ID": "c2fm31f7f64tkgl40r60",
                    "ParentID": "c2fm31f7f64tkgl40r5g",
                    "Author": "Gene",
                    "ReplyTo": "aosecky",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 8, 2011 at 12:50 pm",
                    "Content": "that worked, thx"
                }
            ]
        },
        {
            "ID": "c2fm31f7f64tkgl40r6g",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 7, 2011 at 6:10 pm",
            "Content": "This is really neat. I look forward to seeing more posts in the future. Will be nice to see some of the parts of Japan that aren’t strictly, ah, two-dimensional, if you will, though I hope they are as arguably, um, _animated_ as the portrayals of Japan people like myself are useful.\n\nOkay, sorry about that. Those were bad, even for puns. I like this idea, though, so I’m looking forward to more!"
        }
    ]
}