{
    "Replies": [
        {
            "ID": "c2fm42n7f64tkgl40v8g",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 23, 2010 at 12:39 am",
            "Content": "Using movies? Haha nice…\n\nSeriously decent list. I was surprised you put Amagami on there at all, when you haven’t even seen the last arc of the show with Tsukasa Ayatsuji, easily the best girl of the whole show by leaps, bounds, and lightspace travel.\n\nAt the end of the day, Arakawa also rated “average” for me too. Definitely could recommend it to my friends, even ones who haven’t seen anime. That was what made me decide to slam that into the recurring anime slot. It was one that everyone could agree was “generally ok” and we could avoid having it compared to other shows. Plus that meant we could use Arakawa Bridge x Bridge, an equally average show during the semester. We don’t always get to use sequel shows, because when we do they’re usually awkward (see: S2 of Darker than Black last semester).\n\nSorry you hated Shiki, the doctor’s awesome. Then again, definitely Steve’s and my fault for hyping it so much. Part of the appeal for both of us is waiting each week for the new episode. Similar thing happened with me and Code Geass R2 every Sunday at 2:00 AM. I saw that show live every week. I didn’t understand the Japanese, but goddammit did I know what was going on. Mercifully for me and my sleep schedule, there aren’t many live streams of Japanese televisoin any more. Nicolive is going to create problems for me down the line, I know it…\n\nReserving opinions on the other shows until after I review them, I will just say right now that I purposefully am not including OVAs/Movies in my list, because they’re on a different level than television, especially in terms of budget and feature length. Good list though Grant, A-",
            "Replies": [
                {
                    "ID": "c2fm42n7f64tkgl40v90",
                    "ParentID": "c2fm42n7f64tkgl40v8g",
                    "Author": "Grant Walker",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 23, 2010 at 2:36 pm",
                    "Content": "Haha, yeah, I suppose it’s not entirely fair to toss movies in with the rest of things, but I wanted to reach 10, I swear. Either way, though, considering my limited viewing it’s still pretty easy to see which anime show I would put on top this year (Tatami Galaxy).\n\nAnd I did actually make sure to finish Ayatsuji’s arc before posting, haha. Even then, I like all of the girls, though, so I have a hard time finding a favorite… I’m kind of surprised Amagami is on this list, too, the way it is, but I’m hopelessly taken by it. I don’t think there’s anything logical about my adoration for it blame the whimsical air it brought to finals week.\n\nAs for Shiki, I still don’t think it’s terrible, and I know I’ll be finishing it, for better or worse; I guess it just doesn’t excite me as much as it does other people. Either way, I’m watching and plan on putting some effort into enjoying it. The doctor _is_ pretty much the highlight of the show.\n\nLooking forward to other lists, now!",
                    "Replies": [
                        {
                            "ID": "c2fm42n7f64tkgl40v9g",
                            "ParentID": "c2fm42n7f64tkgl40v90",
                            "Author": "Grant Walker",
                            "ReplyTo": "Grant Walker",
                            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "December 23, 2010 at 2:37 pm",
                            "Content": "In other news, html fail makes Grant ~~a depressed panda~~ glad it’s close to Christmas."
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm42n7f64tkgl40va0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 23, 2010 at 6:41 pm",
            "Content": "Great list and insights as usual. I always enjoy reading your reviews. You know exactly what you like and don’t like about shows, you cover all of the bases, and you’re never afraid to be critical of popular shows. I also like your writing style; it’s “casually professional,” as from someone who enjoys critiquing anime but doesn’t forget to enjoy it for what it is.\n\nListen to me, it’s almost like I’m writing a review of your reviews. It’s reminded me that I need to be writing my own list, and I will certainly be having difficulty reaching 10 without using movies/OVAs. I’m particularly looking forward to reading Gene’s, which will undoubtedly be infinitely more educated than mine.",
            "Replies": [
                {
                    "ID": "c2fm42n7f64tkgl40vag",
                    "ParentID": "c2fm42n7f64tkgl40va0",
                    "Author": "Gene",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 23, 2010 at 8:58 pm",
                    "Content": "The amount of time I wasted this year, man. It’s nearly incalculable.\n\nI should’ve attached a scorecard, but I counted 27 Television anime series this year. MY GOD. SOMEONE STOP ME."
                },
                {
                    "ID": "c2fm42n7f64tkgl40vb0",
                    "ParentID": "c2fm42n7f64tkgl40va0",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 24, 2010 at 12:43 am",
                    "Content": "Wow, the praise is too much. I’m quite flattered, though!\n\nBut yeah, I had to reach to get to 10. I guess using less would have been fine, but.. meh! I look forward to seeing both yours and Gene’s lists. Gene’s should be interesting since he’ll have to actually put some effort in _narrowing his down_ quite a bit."
                }
            ]
        }
    ]
}