{
    "Replies": [
        {
            "ID": "c2fm25f7f64tkgl40opg",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "July 10, 2011 at 12:31 pm",
            "Content": "Aw man, I thought based on the title that Grant got back from AX… Now I’m disappointed to see it was just Chaeha posting! RSS feeds are a godsend, by the way, Chaeha. There’s no way I’d ever miss a post on the blog.\n\nlol’d at the spending money when mad, I know that feeling. One time I was mad at the sun, so I bought sunglasses. Wait, this is an anime blog?\n\nOh yeah, Chaeha, do you have pictures that your friend took from when we played video games at that place? I got some from the guy who runs the shop but none from your friend.",
            "Replies": [
                {
                    "ID": "c2fm25f7f64tkgl40oq0",
                    "ParentID": "c2fm25f7f64tkgl40opg",
                    "Author": "Chaeha",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "July 10, 2011 at 1:48 pm",
                    "Content": "You can find it from his facebook page. His facebook name is Justin “Mechazawa” Torres. And yes, it’s Mechazawa from Chromatie. I’m sure he’ll add you as friend, but he’s in Korea now, and I don’t know if he brought his laptop."
                }
            ]
        },
        {
            "ID": "c2fm25f7f64tkgl40oqg",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "July 18, 2011 at 7:12 am",
            "Content": "This post actually did surprise me! I agree that the blog has been slow lately, but of course that’s understandable what with vacation. I’ll make a post reporting on AX _eventually_.\n\nAnyway, all this merch you’ve been getting has made me relieved at all the money I DIDN’T spend at AX. I was so tempted sometimes, but… I’ll wait until the post for that. Can I be a rich engineer yet?",
            "Replies": [
                {
                    "ID": "c2fm25f7f64tkgl40or0",
                    "ParentID": "c2fm25f7f64tkgl40oqg",
                    "Author": "Chaeha",
                    "ReplyTo": "Grant Walker",
                    "Image": "http://1.gravatar.com/avatar/b92b44908e9ee2565962d025c6291132?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "July 18, 2011 at 4:21 pm",
                    "Content": "Man, you should have gotten the glowing leeks from the Miku concert! Well, I get tempted a lot, so I know I would buy tons of stuff and probably regretting it by now."
                }
            ]
        }
    ]
}