{
    "Replies": [
        {
            "ID": "c2fm4377f64tkgl40vc0",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "January 17, 2011 at 12:17 pm",
            "Content": "lol Gene… lol\n\nMadoka is the only “good” show so far (reservations on Fractale, like you said). The rest of the season consists of shows to watch because they’re so bad/generic they’re amusing to watch.\n\nInfinite Stratos: super fucking generic. Oh that’s the childhood friend/tsundere chick. Oh, that the chick with the superiority complex. etc, etc…\n\nFreezing: Hey look, it’s pretty and there’s gore and tits, just like that other show during the summer with zombies.\n\nGosick: Hey look, it’s Bones doing a show with blood and a steampunk setting.\n\nOnii-chan no koto nanka zenzen suki janain dakara ne: …………..BWAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA. It’s just that bad. Think To Love Ru meets Yosuga no Sora.\n\nKore wa Zombie desu ka?: again, hahahahahahahahahahahahahahahaha. This one is legitimately funny though.\n\nMahou Shoujo Madoka Magica: The only show with any sort of legitimacy thus far in the season (waiting on Fractale). Good OP, great soundtrack, story is typical mahou shoujo with a sprinkling of Shaft, and the art is fucking awesome. Visually, this show is like Bakemonogatari+Sayonara Zetsubo Sensei. Hopefully Shaft does what Shaft does and keeps this a consistent show. This is probably the one show from this season that will be acceptable at a showing, outside bad anime night (inb4 typical response).\n\nAnd the German in ep2 is just some esoteric gibberish. /a/ is doing what /a/ does and reading too much into any decent show (see: any EVA thread on /a/).",
            "Replies": [
                {
                    "ID": "c2fm4377f64tkgl40vcg",
                    "ParentID": "c2fm4377f64tkgl40vc0",
                    "Author": "Gene",
                    "ReplyTo": "steve",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "January 17, 2011 at 12:42 pm",
                    "Content": "Hahahaha I’m just messing with you Steve. Zombie Desu Ka is legitimately funny. Not entirely unrelated, we finally got a magical boy anime 😉\n\nStill, I’m in complete agreeance with you this season, we’ll see how it shapes up. You did see that 2chan actually started posting in the 4chan threads because we’re smarter than they are, right? I did like some of the pictures that have come out so far.\n\n[This one](http://i52.tinypic.com/9u2e5v.jpg) is my favorite."
                }
            ]
        }
    ]
}