{
    "Replies": [
        {
            "ID": "c2fm3if7f64tkgl40to0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 18, 2011 at 2:31 am",
            "Content": "I’d make a snarky comment about this post referring to Wednesday as if it’s next week and not this week, but it’s too well-constructed to disparage on its punctuality.\n\n[C] is certainly getting interesting. I’m still skeptical as to whether it will pull off a decent ending, something a lot of 1-cour series flop on. But at the very least, it’s had a better track record of amusing me the movie marathon. UBW was good, Borrower Arreity was alright, Precure! was self-explanatory, and…\n\nThe Eureka Seven movie was special. It really was. The writers could not have defied my expectations more if they tried. Try as I might, I cannot see the direction they took. It doesn’t even look like it was designed to make money. For those who have never seen the series, it was probably a confusing experience that resolved nothing with some flimsy attempts at copying Evangelion. For me, who has, it was an _incredibly_ confusing experience that resolved nothing with some flimsy attempts at copying Evangelion. The only difference being that, Eureka Seven being the first legitimate anime I watched on not-Cartoon-Network and being my gateway series, my metaphorical childhood got trainraped in an alleway.\n\nThe movie did two things well. First, Eureka’s goddamned kids had a thankfully insignificant role. Second, the movie deviated so far from its source material that for anyone who’s interested in seeing the original series, this movie will do nothing to detract from it. Seriously, reading the back of the DVD case would probably spoil the series more thoroughly.\n\nAnyone notice Eureka’s hair changed on a somewhat proportionally accurate time scale to the original series?\n\ngahh wtf seriously shes not a vampire and there were no evil tentacle hand aliens and anemone was insane and was dewey a pedophile im not really sure but i dont think so and why are there fluffy pokemon in the robots\n\nk ill go away now",
            "Replies": [
                {
                    "ID": "c2fm3if7f64tkgl40tog",
                    "ParentID": "c2fm3if7f64tkgl40to0",
                    "Author": "dante",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/b0a5ad3c3df8b9534c485dda177c729c?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "October 18, 2011 at 3:15 am",
                    "Content": "While basically everything about the movie was beyond BS, I got a REAL strong pedo vibe from Dewey in the series. Seriously, have you SEEN those uniforms he had the kids wear? And I thought Irie was bad."
                }
            ]
        },
        {
            "ID": "c2fm3if7f64tkgl40tp0",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 18, 2011 at 1:30 pm",
            "Content": "First.\n\nOh goddammit.\n\nDon’t worry, I did this on purpose. Yeah. Trolled or something. All part of the plan. Showing bad material just before the good stuff makes the good stuff look even better! That’s how we’ve always done things, and we’d never sacrifice quality of the showings for lack of material! Never done that before! I’m a genius dammit!\n\nPersonally I liked the fight scenes a lot. I still think the ending’s hilarious. Brb getting serrated knife."
        }
    ]
}