{
    "Replies": [
        {
            "ID": "c2fm43n7f64tkgl40vd0",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 21, 2012 at 2:19 am",
            "Content": "WHAT IS HAPPENING TO ANIME\n\nSymphogear was difficult to take seriously. Very little is explained, and what is explained is largely hand-waving. It’s really just an excuse to have girls singing to kill off aliens, motive and context be damned. Honestly, Macross probably did the whole mecha-music fusion better, and I haven’t even watched it. Maybe Chaeha could elaborate.\n\nBrave 10 was probably the best show that night, which speaks volumes for what was shown that night. The characters were about as basic as they get. Dark, angsty, brooding MC-kun with happy-go-lucky clingy love-interest-chan, some mild drama, and a lot of fighting. inb4 the villains send lackeys in groups of four. And Isanami probably set some sort of world record for how quickly she fell in love with Saizou. At the very least, I could ignore everything but the fighting and pretend to be entertained.\n\nKill Me Baby. This is the worst anime. Kill me. This is the worst anime. I think I laughed once all 3 episodes, and I don’t even remember what happened. This is the worst anime. There is no budget. This is the worst anime. They lingered way too long on punchlines for any of the jokes to be effective. This is the worst anime. Every joke was visible a mile away. This is the worst anime. Treating your audience like idiots by painfully pointing out the jokes several times in a row does not make a good comedy. This is the worst anime. Nichijou did it better. This is the worst anime. The OP was horrid. This is the worst anime. Kill me. This is the worst anime. This is the worst anime.\n\nI really hate to be the angry, jaded, bitter guy that thinks everything is terrible nowadays, and just bitches about how shitty anime’s gotten, but Winter 2012 is not throwing me any bones. This has honestly been a terrible start to the year, especially considering last year’s relatively good lineup. I’ll probably hibernate this season a little and watch Penguindrum or something instead.",
            "Replies": [
                {
                    "ID": "c2fm43n7f64tkgl40vdg",
                    "ParentID": "c2fm43n7f64tkgl40vd0",
                    "Author": "dante",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/b0a5ad3c3df8b9534c485dda177c729c?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "February 21, 2012 at 2:33 am",
                    "Content": "It’s 2:30 AM on a Tuesday. Go to sleep already!\n\nNow, if I can parse through your intricate code, you’re not a fan of budget anime or comic strips with visuals. That’s a fair point, but we’ve both seen shows that can pull it off, it’s just a matter of execution and timing. Sadly, Kill Me Baby is lacking in both departments."
                },
                {
                    "ID": "c2fm43n7f64tkgl40ve0",
                    "ParentID": "c2fm43n7f64tkgl40vd0",
                    "Author": "Grant Walker",
                    "ReplyTo": "Chris",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "February 28, 2012 at 9:29 pm",
                    "Content": "I got the impression you didn’t like Kill Me Baby or something."
                }
            ]
        }
    ]
}