{
    "Replies": [
        {
            "ID": "c2fm3nv7f64tkgl40uf0",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 5, 2011 at 8:55 pm",
            "Content": "\\\u003e\\\u003e _I Geso_\n\nUgh. Pun … so … terrible.\n\nAs I said before, I _am_ looking forward to giving OreImo a second chance. Hopefully with a more analytical mindset I can at least appreciate it, if not necessarily enjoy it, the second time around.\n\nDo you have EotE 1-11 in 1080p? I picked up movie 1 (which I guess is considered ep12) and ep1-11 off the drive a while back, but only the movie is actually in 1080p. I’ll hold off on watching them if I can get 125% more pixels.\n\n\\\u003e\\\u003e _Star Driver, Otome Youkai, Gosick_\n\nDon’t remember ever hearing of Otome Youkai. Maybe it’ll avoid the obvious outcome of its description (“Three dudes team up with three lady (half-)youkai to do [stuff that probably won't matter at all]“), but the fact that the official art has already paired up the couples does not bode well.\n\nStar Driver will be FABULOUS and GINGA BISHOUNEN. It was popular in Japan, though, so it’s probably okay, because we know the Japanese have excellent taste, right?\n\n~~Loli Sherlock Holmes~~ ~~Holmes-chan~~ Gosick is okay. I can’t imagine many people at the meeting (except Hilary, who has repeatedly informed me of how much she likes the show) will be particularly enamored with it, since anime is rather hard to pull off mystery in, despite Bones’ good attempts.\n\nWe really are running out of crap to watch, aren’t we? ;\\_;\n\n\\\u003e\\\u003e _Madoka_\n\nNone of these theories involve MORNING RESCUE, and are therefore invalid. Try again, internets.",
            "Replies": [
                {
                    "ID": "c2fm3nv7f64tkgl40ufg",
                    "ParentID": "c2fm3nv7f64tkgl40uf0",
                    "Author": "Grant Walker",
                    "ReplyTo": "Jack",
                    "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "February 5, 2011 at 11:18 pm",
                    "Content": "\\\u003e\\\u003e None of these theories involve MORNING RESCUE, and are therefore invalid.\n\nTrufax. Turns out Homura’s not trying to make a world where everyone’s happy, just one where there is MARNING LESKEW."
                }
            ]
        },
        {
            "ID": "c2fm3nv7f64tkgl40ug0",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "February 5, 2011 at 11:24 pm",
            "Content": "Thankfully I grabbed Eden of the East a couple weeks ago at VP-Matt’s recommendation, but not the movie. I’ll try to get the 11 episodes out of the way before Wednesday, though. SOMEhow. I feel like I don’t have as much free time as I should.\n\nHolding off theories on Madoka, mostly because I’m lazy and uncreative. Some of the current ones are pretty interesting, though… can’t wait to see what happens."
        }
    ]
}