{
    "Replies": [
        {
            "ID": "c2fm2fn7f64tkgl40png",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 26, 2010 at 6:25 pm",
            "Content": "Powerful list there Chris I sure do love K-On!! laughinganimeclub.jpg\n\nBut no seriously I watched K-On 2 as well. Did not regret but did not enjoy either. Sora No Woto was pretty good, obv. can’t recommend it to EVERYone but I mean, it wasn’t horrifying either. Listen to me, no wonder I’m awful.\n\nRailgun was def. better than Index, can’t say it was better than the first two arcs of Index but definitely overall better than Index. If anything it was far less ADD than Index and had plenty of Misaka and that trollface Saten. What’s Uiharu’s ability? I forget. 🙂\n\nDefinitely a really solid list. Can’t really kill you on the first two, seeing as I watched them too. Brotonashi fo sho’.\n\nAAAAAAAAAA SQUID GIRL",
            "Replies": [
                {
                    "ID": "c2fm2fn7f64tkgl40po0",
                    "ParentID": "c2fm2fn7f64tkgl40png",
                    "Author": "Chris",
                    "ReplyTo": "Gene",
                    "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 27, 2010 at 12:46 am",
                    "Content": "Uiharu revealed her (Level 1) ability was to keep taiyaki warm. Most popular theories to her power is temperature control and entropy stop (which are kinda related, anyway). Either way, level 5 possibilities are ridiculously broken, and either would allow her to commit mass genocide (both allow her to completely stop all physical processes in a space of arbitrary size). Actually, half of me wonders if she could even overcome Touma’s Imagine Breaker by simply reducing the environment to absolute zero temperature."
                }
            ]
        },
        {
            "ID": "c2fm2fn7f64tkgl40pog",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 26, 2010 at 11:35 pm",
            "Content": "Well, I’d say I think your list is good, but–like with Gene’s–I’ve only seen part of it. In fact, I’ve really only seen Angel Beats! and the Tatami Galaxy on this list. So I can’t say anything about the list, but it seemed put together pretty well, sure! And it was fun to read. I don’t think I’ve seen enough of K-On to count it.\n\nOf course, quite excited to see The Tatami Galaxy in first place! And that Disappearance got a good feature.\n\nLike I said, though, good read despite not having seen most of the shows. Looks like there are a handful I really need to grab sometime.\n\nLittle tidbit about squid girl is… kind of ridiculous, but I guess that’s why it’s worth posting. I might have to go back and watch the show in the impossibly unlikely case where the studio adopts this fan theory."
        },
        {
            "ID": "c2fm2fn7f64tkgl40pp0",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "December 29, 2010 at 5:45 pm",
            "Content": "lol squidgirl, I will never be able to look at you the same again.",
            "Replies": [
                {
                    "ID": "c2fm2fn7f64tkgl40ppg",
                    "ParentID": "c2fm2fn7f64tkgl40pp0",
                    "Author": "Gene",
                    "ReplyTo": "steve",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "December 29, 2010 at 11:35 pm",
                    "Content": "Dude, I know right? I finished that series just because of that."
                }
            ]
        }
    ]
}