{
    "Replies": [
        {
            "ID": "c2fm2of7f64tkgl40qmg",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "April 24, 2011 at 11:37 pm",
            "Content": "CFW for BBCSII! Wish you could’ve joined us over at Fiji when we were playing Continuum Shift with the sticks, Chaeha kept owning Shannon’s face off until Shannon’s Bang eventually won once or twice. I forget.\n\nPhantom Breaker’s one I haven’t heard about, but looks cool. I don’t have a 360 but I can always borrow Chris’ ;\\_;",
            "Replies": [
                {
                    "ID": "c2fm2of7f64tkgl40qn0",
                    "ParentID": "c2fm2of7f64tkgl40qmg",
                    "Author": "steve",
                    "ReplyTo": "Gene",
                    "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "April 25, 2011 at 8:43 pm",
                    "Content": "Where was I in this brawl of awesome? I need some scrubs upon which to pwn some face in.\n\nBBCSII sucks according to the competitive fighting community, which makes me sadface. All the people from dustloop are moving to Arcana Heart or MVC3. In terms of tier lists, Tsubaki and Ragna pretty much switched places, Bang was nerfed through the floor, Makoto rapes hard, and Valk is still broken as shit. So Tsubaki is the new autopilot and Ragna sucks ass. My characters (Tsubaki sub and Makoto main) went from shit tier and mid to top and broken. Long combos are pretty much gone too (which makes me sad since my main is Makoto).\n\nIt’s all good though, Arcsys announced a new Guilty Gear (=DDDDDDDDDDDDD )and I bought Rift over the weekend. Falling grades, here I come!"
                }
            ]
        }
    ]
}