{
    "Replies": [
        {
            "ID": "c2fm34f7f64tkgl40rfg",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "May 23, 2011 at 9:48 pm",
            "Content": "So I DON’T get to dress up in a bikini to wash cars while saying “atashi kawaii yo nyan~”\n\nThis is disappointing Gene…",
            "Replies": [
                {
                    "ID": "c2fm34f7f64tkgl40rg0",
                    "ParentID": "c2fm34f7f64tkgl40rfg",
                    "Author": "steve",
                    "ReplyTo": "steve",
                    "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "May 23, 2011 at 9:49 pm",
                    "Content": "With cat ears and a tail.",
                    "Replies": [
                        {
                            "ID": "c2fm34f7f64tkgl40rgg",
                            "ParentID": "c2fm34f7f64tkgl40rg0",
                            "Author": "Gene",
                            "ReplyTo": "steve",
                            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "May 24, 2011 at 8:16 am",
                            "Content": "No, I strictly forbid anything but dressing like Dio and yelling ZA WARUDO and MUDA MUDA MUDA while you spray cars clean\n\nOn second thought \\*imagines Steve in a Bikini\\*"
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm34f7f64tkgl40rh0",
            "Author": "Digital Boy",
            "Image": "http://1.gravatar.com/avatar/5f48166bdfa151136fc7935091c5a476?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "May 23, 2011 at 10:36 pm",
            "Content": "Not sure I’m supposed to say thank you or fuck you so I’ll take the Ladd Russo route and do both.\n\n[http://www.youtube.com/watch?v=cO1SS127IMk](http://www.youtube.com/watch?v=cO1SS127IMk)\n\nI’m fascinated that you clash with me because I don’t like the things you like, because it’s almost always the opposite case. I’ve had people who absolutely hated me, even though I liked everything they liked, simply because \\*I liked things that they didn’t,\\* which is literally the weakest attitude imaginable. It’s interesting that this time I apparently don’t like what you like, which makes me very curious because there’s exceedingly little that I don’t like about anime.\n\nAlso your whole speech is kind of ass-backwards. The idea isn’t that “some people have shitty tastes but they’re still great guys.” What you should be considering is that everyone has unique tastes, all of which are equal, and bashing on someone else’s taste is the pinnacle of douchebaggery.",
            "Replies": [
                {
                    "ID": "c2fm34f7f64tkgl40rhg",
                    "ParentID": "c2fm34f7f64tkgl40rh0",
                    "Author": "Gene",
                    "ReplyTo": "Digital Boy",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "May 24, 2011 at 8:46 am",
                    "Content": "STOP HATING WHAT I LIKE ;\\_;\n\nMatt covered everything below, thanks for posting by the way."
                }
            ]
        },
        {
            "ID": "c2fm34f7f64tkgl40ri0",
            "Author": "Daniel Pascua",
            "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "May 23, 2011 at 11:52 pm",
            "Content": "“…gave Daniel a room to sleep in for the night at wasabi con…” Oh yeah, that’s right! More like I owe them a lot…\n\nAnd I seem to really agree with most of what you said here.\n\n“You don’t know as much as you think, your taste in anime sucks too… Really though, your taste isn’t that bad” – There are a lot of times I’d like to tell people to consider this, anime related or not.\n\n“People will argue with people over just about anything.” – Yeah I believe it. Especially over the internet."
        },
        {
            "ID": "c2fm34f7f64tkgl40rig",
            "Author": "Matt Armijo",
            "Image": "http://1.gravatar.com/avatar/f4bb6d94be588a76ff3228cda9dad264?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "May 24, 2011 at 3:19 am",
            "Content": "Why, Gene?\n\nWhy do you have to portray my role at Wasabi-Con in such a belligerent manner? It’s not like I’m some dark puppet master, manipulating you from the shadows. I’m more of a humble civil servant, like Jar Jar Binks:\n\n[Oh wait…](http://www.youtube.com/watch?v=6ovO7lmFYCc)\n\nOh, and to Digital Boy:\n\nI just so happened to click on Gene’s link to your blog, and I felt as though I’d entered some alternate time-space because both of your writing styles are nearly identical (even down to the pictures you post and the captions you make). That said, both your points seem to be opposite sides of the same coin, so I really can’t see Gene’s dislike of you as more than a Freudian dislike of what he sees in himself.\n\nGene’s speech was accurate in the context of our own anime club. We (the officers) don’t hold any grudges and we like all of our members, but we will call people out for liking a decidedly awful piece of “artwork.” As you can tell from the Wasabi-Con story, that can actually lead to some productive discussions and changes in Con policy. We don’t claim to be elitist (God, not with the stuff Gene watches), but we do recognize the basic differences between “bad” and “different.” Does it make us (and by that, I mean “me”) seem like jerks? Maybe, but everyone can use a change of perspective, and disagreement at least opens the door for discussion. Tacit acceptance leads to stagnation, and really, no one wants to see MORE of that which has comprised the majority of anime for the last 2 years.",
            "Replies": [
                {
                    "ID": "c2fm34f7f64tkgl40rj0",
                    "ParentID": "c2fm34f7f64tkgl40rig",
                    "Author": "Gene",
                    "ReplyTo": "Matt Armijo",
                    "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "May 24, 2011 at 8:44 am",
                    "Content": "Matt puts it more eloquently than I do, he knows how to shadow-govern like a boss. I think it is pretty funny how I claim we should be nice to people when I take a ton of despicable cheapshots at Digiboy throughout the post. Hell, even the title.\n\nI have to disagree with Digiboy when he says tastes are equal, or that they are even specifically quantifiable to some sort of scale. They aren’t even specific to people. Last time I met someone who had the exact same tastes as I did we had a pretty dull conversation about how bad Angel Beats was. Matt’s dead on the money again when he says it’s some sort of Freudian dislike of what I see in myself, I hate people like me. Or rather, I like arguing with people like me. I’m just such a… [formidable opponent.](http://www.youtube.com/watch?v=K24VVdE5HnE)\n\nAnyway, I still stand by “people have crappy tastes but they’re still good guys” because people DO have crappy tastes (the whole damn club liked Garzey’s Wing, wtf is wrong with you people) and calling them out on it blah blah blah read Matt’s post above this one.",
                    "Replies": [
                        {
                            "ID": "c2fm34f7f64tkgl40rjg",
                            "ParentID": "c2fm34f7f64tkgl40rj0",
                            "Author": "digital boy",
                            "ReplyTo": "Gene",
                            "Image": "http://1.gravatar.com/avatar/5f48166bdfa151136fc7935091c5a476?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                            "Date": "May 24, 2011 at 11:08 am",
                            "Content": "That video was bloody hilarious XD\n\nWell, in any case, you guys are pretty cool. I tend to respond aggressively to criticism, especially about my tastes, because I have a \\*lot\\* of trolls and haters, but I can tell (not from your posts, but from your replies lol), you guys aren’t trying to be that.\n\nSomehow I sensed as soon as I read it that the post title was a parody of mine and thought it’d end up being a whole post about my blog lol. As a correction, though, I always capitalize OR in those. By the way, All Of My Post Titles Are References To Hayate The Combat Butler (Yes, Even This One)."
                        }
                    ]
                }
            ]
        },
        {
            "ID": "c2fm34f7f64tkgl40rk0",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "May 25, 2011 at 7:32 pm",
            "Content": "It’s good you did all this research to be a good president… I’m not sure how much of it is actually realized by the club, though.\n\nI mean, the most I contribute is floundering around a little bit, trying to justify liking or not liking a particular anime. Which is kind of hard, not being a superb writer or anything.\n\nMaybe from now on I’ll just pretend to not like anime. Writing’s a lot easier when all you do is complain. I think that’s why acting like an elitist faggot and parading your own taste around is so popular: no one wants to listen to how much you ENJOYED something.\n\nAnyway, this is a nice post. It’s good to remind people that, even when our tastes collide a bit, we’re all anime fans, and none of us are ‘professionals’ at this whole anime-watching thing.\n\nAlso surprised Digital Boy posted. Kind of cool, though. Hope the DU anime club goes ahead and visits us sometime soon, too. I’m bad at talking to people, so it’s just a matter of being around them long enough that I get comfortable enough to start saying stupid stuff in front of them."
        }
    ]
}