{
    "Replies": [
        {
            "ID": "c2fm29f7f64tkgl40ph0",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "April 16, 2013 at 1:45 am",
            "Content": "This show actually charmed me when it was first shown in club, and I always meant to watch more… but never got around to it.\n\nThanks for writing this. Hopefully this’ll inspire me to finish it."
        },
        {
            "ID": "c2fm29f7f64tkgl40phg",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "April 17, 2013 at 3:38 pm",
            "Content": "But being good at things is hard, why can’t I just take a pill and be good at everything without building the maturity and fortitude to understand what I’m being good at and what it entails?\n\nAnyway, _Chihayafuru_ is on that vague list of “things I’m going to get to” when I find the time. After I get through all this crappy anime I’m trying to drag myself through now.\n\nand who would ever watch saki lol it’s terrible hahahaha",
            "Replies": [
                {
                    "ID": "c2fm29f7f64tkgl40pi0",
                    "ParentID": "c2fm29f7f64tkgl40phg",
                    "Author": "Daniel",
                    "ReplyTo": "Chris",
                    "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
                    "Date": "April 18, 2013 at 9:10 am",
                    "Content": "“But being good at things is hard, why can’t I just take a pill and be good at everything without building the maturity and fortitude to understand what I’m being good at and what it entails?”\n\nAs a main character says at the end of season 1 episode 20 when being offered what could be called an easy way up, rather than taking the easy way, it’s better to be someone who doesn’t run away. So, even if such a pill existed, taking it would be just like running away, and it would be difficult to be satisfied with yourself if you were to do so. Also, the show exemplifies the feeling that difficult rewards are the ones most satisfying, and difficult dreams are the ones most meaningful. One way this feeling is shown is in the way Chihaya first becomes passionate about karuta, which appears in the first episode of the first season, and is referenced again multiple times. It is this sense of accomplishment and satisfaction that would be lost if one were to take an easy way out. As such, even if there were some easy way to become good at everything, for the reasons mentioned here, it may never be worth it.\n\nAhem. That feels like what I’d write for an English class, but I haven’t had one of those in a long time."
                }
            ]
        },
        {
            "ID": "c2fm29f7f64tkgl40pig",
            "Author": "Daniel",
            "Image": "http://0.gravatar.com/avatar/6c292d10e3f80930f653dc54f3c6af72?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "April 18, 2013 at 9:28 am",
            "Content": "I think the queen in Chihayafuru was made to resemble the queen in real life, who is apparently also the youngest queen in history.\n\nChihayafuru queen match: [http://puu.sh/2CpcR](http://puu.sh/2CpcR)\n\nReal life queen match: [http://www.nicovideo.jp/watch/sm20319134](http://www.nicovideo.jp/watch/sm20319134)\n\nThose real life players are crazy too. When there were one syllable cards, I went back and tried to stop the player as soon as I heard the first sound, and they were already hitting the correct card out when I paused it."
        }
    ]
}