{
    "Replies": [
        {
            "ID": "c2fm3v77f64tkgl40v00",
            "Author": "Gene",
            "Image": "http://1.gravatar.com/avatar/bf8de54594571ea2c52366abdedf94fa?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 21, 2010 at 9:10 am",
            "Content": "Sakamoto Maaya-san worked with Yoko Kanno on Macross Frontier, as far as I can remember. There are probably other ones, but that one strikes me as the most recent.\n\n\\\u003eRyougi’s a quad core\n\nlolwut"
        },
        {
            "ID": "c2fm3v77f64tkgl40v0g",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 21, 2010 at 12:18 pm",
            "Content": "The first I heard her was in the ED to Wolf’s Rain, though the first time I really noticed her voice was also when she played Ryougi Shiki from KnK. She’s got a really nice voice (both speaking and singing). I didn’t know Shiki’s 3rd personality had a blank name, interesting tidbit.\n\n_And she won first in 2D-character-that-you-want-to-take-as-your-bride contest in Japan_\n\nlolwut"
        },
        {
            "ID": "c2fm3v77f64tkgl40v10",
            "Author": "Grant Walker",
            "Image": "http://1.gravatar.com/avatar/d313c191ad77933d5c061e06d8c4c34e?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 21, 2010 at 1:21 pm",
            "Content": "I remember being surprised when I first found out the lady who plays Nino also played Mari… they’re so different I never would have guessed. It’s a bit easier to see the connection to Ouran’s Haruhi and Akashi-san, though, that’s for sure!\n\nI’ve never seen Kara no Kyoukai, though. Looks pretty interesting.\n\n_「 」is the third personality, who is the real murderous one. By the way, I’m NOT trying to keep the name secret or anything. It’s the OFFICIAL NAME._\n\nlolwut"
        },
        {
            "ID": "c2fm3v77f64tkgl40v1g",
            "Author": "Jack",
            "Image": "http://0.gravatar.com/avatar/496cb098d59a4456aae75928d51a1057?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 21, 2010 at 8:23 pm",
            "Content": "Asuka will be back in the third movie. They have rebuilt her: made her better, faster, stronger. They have made…\n\nPIRATE ASUKA\n\nOn another note, it’s neat to see how many different roles these seiyuus play. Maybe I just suck at hearing it, or she’s good at doing different voices, but I didn’t catch the same person voicing Akashi-san and Haruhi. I will now be unable to watch series with seiyuus I’ve heard before without attempting to force myself to recognize the voice.\n\n_If you can laugh after seeing this, I think you’ve played enough Konami games. Wait, never mind. You can never play enough Konami games._\n\nC-C-C-COMBO BREAKER\n\n[trollface.jpg]"
        }
    ]
}