{
    "Replies": [
        {
            "ID": "c2fm1nn7f64tkgl40o0g",
            "Author": "steve",
            "Image": "http://0.gravatar.com/avatar/834ac2aa7edb9ec7c6b798123b0162ba?s=40\u0026d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 28, 2010 at 1:41 pm",
            "Content": "Last night’s showing was pretty damn good.\n\nSayonara Zetsubo-Sensei: wat…\n\nIn all seriousness though, had we not been plagued with the sound issue I think I would have enjoyed this more. I would like to go back and watch its entirety sometime.\n\nHOTD: I watched this show when it aired over this past summer, and I liked it. Unfortunately, the first few episodes are about as win as the anime gets: tons of fanservice (WHICH YOU CAN NEVER HAVE TOO MUCH OF EVER), blood, gore, zombies. The first two episodes are just soooooooooooooooooooooooooooooo good and unfortunately, the series just kind of tapers off after that. I highly recommend that everybody watch episode 6 so that you know just how hard the fanservice game is. When (if) the second season comes out, I will probably still watch the show because I just really like zombie shows… also the fanservice is nice.\n\nHellsing Ultimate: SO MUCH WIN IN THIS SHOW. Seriously, I just finished watching the rest of the series that’s out and I’m fairly impressed. If you like supernatural/horror/psychological genre, you will like this series. I’m really anticipating the last two OVAs now (if they ever come out). Best of the night by far and definitely one to watch in its entirety.\n\nOverall, this was a fairly good showing. Next week is disturbia night, so I’m super fucking excited about that. Horror is probably my favorite genre of anime because with shows like Shiki (which is playing =DDDDDDDDDDDDDDDDDDDDDDD) you get some of the best story telling I have seen in any sort of media outlet.\n\nNow off to Shiki13 =D."
        },
        {
            "ID": "c2fm1nn7f64tkgl40o10",
            "Author": "Chris",
            "Image": "http://1.gravatar.com/avatar/97853935b7d910ef22092f3baec5f573?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "October 29, 2010 at 11:18 am",
            "Content": "I was unfortunately unable to go to this showing, thanks to a Circuits Exam (FFFFFUUUUU) requiring me to study for it. Hope the soda-drinking game was fun, HSotD has no shortage of PLOT. Sorry to hear that there was a skipping problem, Zetsubou-Sensei really is a funny show. It’s basically about a rather depressed teacher (Itoshiki Nozomu) who periodically (unsuccessfully) attempts to commit suicide due to stupid, trivial little things. All of the girls in his class have some kind of weird psychological quirk (bordering on psychosis), and all of them are inexplicably attracted to their teacher. It’s mostly black comedy, and it’s done by Shaft, so you can expect weird art. I don’t know which season was shown during showing, but they’re all probably on the club HD if you want to check them out.\n\nI’m definitely looking forward to Disturbia Night next week. Hope to see you all there!"
        }
    ]
}