{
    "Replies": [
        {
            "ID": "c2fm2h77f64tkgl40pvg",
            "Author": "dante",
            "Image": "http://1.gravatar.com/avatar/b0a5ad3c3df8b9534c485dda177c729c?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 16, 2011 at 1:40 am",
            "Content": "Funny puppet forgets that when he breaks loose from his strings, he falls straight into the wood chipper.\n\nI felt kinda sad about this showing (well, more so than other showings) because this one seemed by and large the most boring. Guilty Crown? Repetitive musical. Persona 4? Repetitive plot and script. Baka Test 2? Repetitive party shenanigans. Amnesia conclusion? Repetitive failure.\n\nI think the most rewarding parts of the evening were the Persona 4 OP and Day[9] slamming the door in Pimpwalk’s face (oh, and DAT PICTURE).\n\nJust 3 showings left, Gene. Do us proud (or at least raise the bar an inch off the ground for the new guy)."
        },
        {
            "ID": "c2fm2h77f64tkgl40q00",
            "Author": "Jack",
            "Image": "http://1.gravatar.com/avatar/1bb483e13e811345f87c848fa0d8e42b?s=40\u0026d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D40\u0026r=G",
            "Date": "November 16, 2011 at 7:18 pm",
            "Content": "lol gene u have great tastes in anime and i’ll do my best to uphold that tradition with timeless classics like DBZ, Strike Witches, and The One Piece. :3\n\nOn to the showing:\n\nNo idea what happened in Guilty Crown. Something about music and ripping shit out of people’s hearts? Yeah. Something like that. (Showed up late, didn’t pay attention)\n\nI never actually played the Persona games (don’t hate me!), and my only exposure to Persona 4 prior to this was the Hiimdaisy comics. Reasonably engaging show without having any background with it; on my follow list this season.\n\nBaka Test: lolwut\n\nDay[9] plays Amnesia: FOR FUCKS SAKE DAY[9]. YOU ARE WALKING THE FUCK OVER IT. IT IS RIGHT THERE. UNDER YOUR FEET. IT IS GLOWING. YOU’RE STARING STRAIGHT IT. HOW CAN YOU NOT SEE IT AFTER FINDING ALL THE PICKUPS. GAAAAH. HOW CAN YOU SUCK AT AMNESIA SO BAD. _FUCK_."
        }
    ]
}